# Comparing `tmp/iac_init-0.8.8.tar.gz` & `tmp/iac_init-0.8.9.tar.gz`

## filetype from file(1)

```diff
@@ -1 +1 @@
-gzip compressed data, was "iac_init-0.8.8.tar", max compression
+gzip compressed data, was "iac_init-0.8.9.tar", max compression
```

## Comparing `iac_init-0.8.8.tar` & `iac_init-0.8.9.tar`

### file list

```diff
@@ -1,49 +1,49 @@
--rw-r--r--   0        0        0    16295 2024-05-29 14:37:56.034790 iac_init-0.8.8/LICENSE
--rw-r--r--   0        0        0        0 2024-05-29 14:37:56.034790 iac_init-0.8.8/README.md
--rw-r--r--   0        0        0      392 2024-05-29 14:37:56.034790 iac_init-0.8.8/iac_init/__init__.py
--rw-r--r--   0        0        0      162 2024-05-29 14:37:56.034790 iac_init-0.8.8/iac_init/__main__.py
--rwxr-xr-x   0        0        0   740216 2024-05-29 14:38:18.142719 iac_init-0.8.8/iac_init/cli/main.so
--rwxr-xr-x   0        0        0    81232 2024-05-29 14:38:18.426718 iac_init-0.8.8/iac_init/cli/options.so
--rw-r--r--   0        0        0     1827 2024-05-29 14:37:56.034790 iac_init-0.8.8/iac_init/conf/__init__.py
--rwxr-xr-x   0        0        0   111224 2024-05-29 14:38:18.942717 iac_init-0.8.8/iac_init/conf/global_settings.so
--rwxr-xr-x   0        0        0   270296 2024-05-29 14:38:24.082707 iac_init-0.8.8/iac_init/scripts/ansible_tool.so
--rwxr-xr-x   0        0        0   327968 2024-05-29 14:38:26.750700 iac_init-0.8.8/iac_init/scripts/apic_connecton_tool.so

@@ -109,45 +109,45 @@
     <d6>   DW_AT_name        : (strp) (offset: 0x1526): char
  <1><da>: Abbrev Number: 42 (DW_TAG_const_type)
     <db>   DW_AT_type        : (ref4) <0xd3>, char
  <1><df>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <e0>   DW_AT_byte_size   : (implicit_const) 8
     <e0>   DW_AT_type        : (ref4) <0xda>, char
  <1><e4>: Abbrev Number: 22 (DW_TAG_typedef)
-    <e5>   DW_AT_name        : (strp) (offset: 0x248f): ssize_t
+    <e5>   DW_AT_name        : (strp) (offset: 0x24a6): ssize_t
     <e9>   DW_AT_decl_file   : (data1) 6
     <ea>   DW_AT_decl_line   : (data1) 77
     <eb>   DW_AT_decl_column : (data1) 19
     <ec>   DW_AT_type        : (ref4) <0xc2>, __ssize_t, long int
  <1><f0>: Abbrev Number: 67 (DW_TAG_typedef)
-    <f1>   DW_AT_name        : (strp) (offset: 0x2eed): wchar_t
+    <f1>   DW_AT_name        : (strp) (offset: 0x2ef3): wchar_t
     <f5>   DW_AT_decl_file   : (data1) 4
     <f6>   DW_AT_decl_line   : (data2) 321
     <f8>   DW_AT_decl_column : (data1) 24
     <f9>   DW_AT_type        : (ref4) <0x90>, int
  <1><fd>: Abbrev Number: 58 (DW_TAG_base_type)
     <fe>   DW_AT_byte_size   : (data1) 8
     <ff>   DW_AT_encoding    : (data1) 5	(signed)
-    <100>   DW_AT_name        : (strp) (offset: 0x4b6a): long long int
+    <100>   DW_AT_name        : (strp) (offset: 0x4b75): long long int
  <1><104>: Abbrev Number: 22 (DW_TAG_typedef)
-    <105>   DW_AT_name        : (strp) (offset: 0x4192): int32_t
+    <105>   DW_AT_name        : (strp) (offset: 0x41aa): int32_t
     <109>   DW_AT_decl_file   : (data1) 7
     <10a>   DW_AT_decl_line   : (data1) 26
     <10b>   DW_AT_decl_column : (data1) 19
     <10c>   DW_AT_type        : (ref4) <0x84>, __int32_t, int
  <1><110>: Abbrev Number: 22 (DW_TAG_typedef)
-    <111>   DW_AT_name        : (strp) (offset: 0x2248): int64_t
+    <111>   DW_AT_name        : (strp) (offset: 0x225f): int64_t
     <115>   DW_AT_decl_file   : (data1) 7
     <116>   DW_AT_decl_line   : (data1) 27
     <117>   DW_AT_decl_column : (data1) 19
     <118>   DW_AT_type        : (ref4) <0xa3>, __int64_t, long int
  <1><11c>: Abbrev Number: 58 (DW_TAG_base_type)
     <11d>   DW_AT_byte_size   : (data1) 8
     <11e>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <11f>   DW_AT_name        : (strp) (offset: 0x45dd): long long unsigned int
+    <11f>   DW_AT_name        : (strp) (offset: 0x45f5): long long unsigned int
  <1><123>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <124>   DW_AT_byte_size   : (implicit_const) 8
     <124>   DW_AT_type        : (ref4) <0x12d>
  <1><128>: Abbrev Number: 90 (DW_TAG_restrict_type)
     <129>   DW_AT_type        : (ref4) <0x123>
  <1><12d>: Abbrev Number: 103 (DW_TAG_const_type)
  <1><12e>: Abbrev Number: 22 (DW_TAG_typedef)
@@ -159,47 +159,47 @@
  <1><13a>: Abbrev Number: 22 (DW_TAG_typedef)
     <13b>   DW_AT_name        : (strp) (offset: 0x1198): uint16_t
     <13f>   DW_AT_decl_file   : (data1) 8
     <140>   DW_AT_decl_line   : (data1) 25
     <141>   DW_AT_decl_column : (data1) 20
     <142>   DW_AT_type        : (ref4) <0x78>, __uint16_t, short unsigned int
  <1><146>: Abbrev Number: 22 (DW_TAG_typedef)
-    <147>   DW_AT_name        : (strp) (offset: 0x41bb): uint32_t
+    <147>   DW_AT_name        : (strp) (offset: 0x41d3): uint32_t
     <14b>   DW_AT_decl_file   : (data1) 8
     <14c>   DW_AT_decl_line   : (data1) 26
     <14d>   DW_AT_decl_column : (data1) 20
     <14e>   DW_AT_type        : (ref4) <0x97>, __uint32_t, unsigned int
  <1><152>: Abbrev Number: 22 (DW_TAG_typedef)
-    <153>   DW_AT_name        : (strp) (offset: 0x2267): uint64_t
+    <153>   DW_AT_name        : (strp) (offset: 0x227e): uint64_t
     <157>   DW_AT_decl_file   : (data1) 8
     <158>   DW_AT_decl_line   : (data1) 27
     <159>   DW_AT_decl_column : (data1) 20
     <15a>   DW_AT_type        : (ref4) <0xb6>, __uint64_t, long unsigned int
  <1><15e>: Abbrev Number: 22 (DW_TAG_typedef)
-    <15f>   DW_AT_name        : (strp) (offset: 0x4a96): Py_ssize_t
+    <15f>   DW_AT_name        : (strp) (offset: 0x4aa1): Py_ssize_t
     <163>   DW_AT_decl_file   : (data1) 9
     <164>   DW_AT_decl_line   : (data1) 107
     <165>   DW_AT_decl_column : (data1) 25
     <166>   DW_AT_type        : (ref4) <0xe4>, ssize_t, __ssize_t, long int
  <1><16a>: Abbrev Number: 42 (DW_TAG_const_type)
     <16b>   DW_AT_type        : (ref4) <0x15e>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><16f>: Abbrev Number: 22 (DW_TAG_typedef)
-    <170>   DW_AT_name        : (strp) (offset: 0x2214): Py_hash_t
+    <170>   DW_AT_name        : (strp) (offset: 0x222b): Py_hash_t
     <174>   DW_AT_decl_file   : (data1) 9
     <175>   DW_AT_decl_line   : (data1) 116
     <176>   DW_AT_decl_column : (data1) 20
     <177>   DW_AT_type        : (ref4) <0x15e>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><17b>: Abbrev Number: 58 (DW_TAG_base_type)
     <17c>   DW_AT_byte_size   : (data1) 4
     <17d>   DW_AT_encoding    : (data1) 4	(float)
-    <17e>   DW_AT_name        : (strp) (offset: 0x333b): float
+    <17e>   DW_AT_name        : (strp) (offset: 0x3353): float
  <1><182>: Abbrev Number: 58 (DW_TAG_base_type)
     <183>   DW_AT_byte_size   : (data1) 8
     <184>   DW_AT_encoding    : (data1) 4	(float)
-    <185>   DW_AT_name        : (strp) (offset: 0x35f7): double
+    <185>   DW_AT_name        : (strp) (offset: 0x360f): double
  <1><189>: Abbrev Number: 22 (DW_TAG_typedef)
     <18a>   DW_AT_name        : (strp) (offset: 0x120b): PyTypeObject
     <18e>   DW_AT_decl_file   : (data1) 2
     <18f>   DW_AT_decl_line   : (data1) 66
     <190>   DW_AT_decl_column : (data1) 28
     <191>   DW_AT_type        : (ref4) <0x19a>, _typeobject
  <1><195>: Abbrev Number: 42 (DW_TAG_const_type)
@@ -215,22 +215,22 @@
     <1a8>   DW_AT_name        : (strp) (offset: 0x1203): ob_base
     <1ac>   DW_AT_decl_file   : (data1) 10
     <1ad>   DW_AT_decl_line   : (data1) 192
     <1ae>   DW_AT_decl_column : (data1) 5
     <1af>   DW_AT_type        : (ref4) <0x4a8>, PyVarObject
     <1b3>   DW_AT_data_member_location: (data1) 0
  <2><1b4>: Abbrev Number: 12 (DW_TAG_member)
-    <1b5>   DW_AT_name        : (strp) (offset: 0x2a1c): tp_name
+    <1b5>   DW_AT_name        : (strp) (offset: 0x2a33): tp_name
     <1b9>   DW_AT_decl_file   : (data1) 10
     <1ba>   DW_AT_decl_line   : (data1) 193
     <1bb>   DW_AT_decl_column : (data1) 17
     <1bc>   DW_AT_type        : (ref4) <0xdf>
     <1c0>   DW_AT_data_member_location: (data1) 24
  <2><1c1>: Abbrev Number: 12 (DW_TAG_member)
-    <1c2>   DW_AT_name        : (strp) (offset: 0x529e): tp_basicsize
+    <1c2>   DW_AT_name        : (strp) (offset: 0x52a9): tp_basicsize
     <1c6>   DW_AT_decl_file   : (data1) 10
     <1c7>   DW_AT_decl_line   : (data1) 194
     <1c8>   DW_AT_decl_column : (data1) 16
     <1c9>   DW_AT_type        : (ref4) <0x15e>, Py_ssize_t, ssize_t, __ssize_t, long int
     <1cd>   DW_AT_data_member_location: (data1) 32
  <2><1ce>: Abbrev Number: 12 (DW_TAG_member)
     <1cf>   DW_AT_name        : (strp) (offset: 0x583): tp_itemsize
@@ -243,15 +243,15 @@
     <1dc>   DW_AT_name        : (strp) (offset: 0x8a8): tp_dealloc
     <1e0>   DW_AT_decl_file   : (data1) 10
     <1e1>   DW_AT_decl_line   : (data1) 198
     <1e2>   DW_AT_decl_column : (data1) 16
     <1e3>   DW_AT_type        : (ref4) <0x676>, destructor
     <1e7>   DW_AT_data_member_location: (data1) 48
  <2><1e8>: Abbrev Number: 12 (DW_TAG_member)
-    <1e9>   DW_AT_name        : (strp) (offset: 0x340b): tp_vectorcall_offset
+    <1e9>   DW_AT_name        : (strp) (offset: 0x3423): tp_vectorcall_offset
     <1ed>   DW_AT_decl_file   : (data1) 10
     <1ee>   DW_AT_decl_line   : (data1) 199
     <1ef>   DW_AT_decl_column : (data1) 16
     <1f0>   DW_AT_type        : (ref4) <0x15e>, Py_ssize_t, ssize_t, __ssize_t, long int
     <1f4>   DW_AT_data_member_location: (data1) 56
  <2><1f5>: Abbrev Number: 12 (DW_TAG_member)
     <1f6>   DW_AT_name        : (strp) (offset: 0x1f6): tp_getattr
@@ -271,43 +271,43 @@
     <210>   DW_AT_name        : (strp) (offset: 0x39b): tp_as_async
     <214>   DW_AT_decl_file   : (data1) 10
     <215>   DW_AT_decl_line   : (data1) 202
     <216>   DW_AT_decl_column : (data1) 21
     <217>   DW_AT_type        : (ref4) <0xccd>
     <21b>   DW_AT_data_member_location: (data1) 80
  <2><21c>: Abbrev Number: 12 (DW_TAG_member)
-    <21d>   DW_AT_name        : (strp) (offset: 0x4a32): tp_repr
+    <21d>   DW_AT_name        : (strp) (offset: 0x4a3d): tp_repr
     <221>   DW_AT_decl_file   : (data1) 10
     <222>   DW_AT_decl_line   : (data1) 204
     <223>   DW_AT_decl_column : (data1) 14
     <224>   DW_AT_type        : (ref4) <0x6f9>, reprfunc
     <228>   DW_AT_data_member_location: (data1) 88
  <2><229>: Abbrev Number: 12 (DW_TAG_member)
-    <22a>   DW_AT_name        : (strp) (offset: 0x361e): tp_as_number
+    <22a>   DW_AT_name        : (strp) (offset: 0x3636): tp_as_number
     <22e>   DW_AT_decl_file   : (data1) 10
     <22f>   DW_AT_decl_line   : (data1) 208
     <230>   DW_AT_decl_column : (data1) 22
     <231>   DW_AT_type        : (ref4) <0xcd2>
     <235>   DW_AT_data_member_location: (data1) 96
  <2><236>: Abbrev Number: 12 (DW_TAG_member)
-    <237>   DW_AT_name        : (strp) (offset: 0x2b0e): tp_as_sequence
+    <237>   DW_AT_name        : (strp) (offset: 0x2b14): tp_as_sequence
     <23b>   DW_AT_decl_file   : (data1) 10
     <23c>   DW_AT_decl_line   : (data1) 209
     <23d>   DW_AT_decl_column : (data1) 24
     <23e>   DW_AT_type        : (ref4) <0xcd7>
     <242>   DW_AT_data_member_location: (data1) 104
  <2><243>: Abbrev Number: 12 (DW_TAG_member)
-    <244>   DW_AT_name        : (strp) (offset: 0x1a75): tp_as_mapping
+    <244>   DW_AT_name        : (strp) (offset: 0x1a66): tp_as_mapping
     <248>   DW_AT_decl_file   : (data1) 10
     <249>   DW_AT_decl_line   : (data1) 210
     <24a>   DW_AT_decl_column : (data1) 23
     <24b>   DW_AT_type        : (ref4) <0xcdc>
     <24f>   DW_AT_data_member_location: (data1) 112
  <2><250>: Abbrev Number: 12 (DW_TAG_member)
-    <251>   DW_AT_name        : (strp) (offset: 0x3c7c): tp_hash
+    <251>   DW_AT_name        : (strp) (offset: 0x3c94): tp_hash
     <255>   DW_AT_decl_file   : (data1) 10
     <256>   DW_AT_decl_line   : (data1) 214
     <257>   DW_AT_decl_column : (data1) 14
     <258>   DW_AT_type        : (ref4) <0x705>, hashfunc
     <25c>   DW_AT_data_member_location: (data1) 120
  <2><25d>: Abbrev Number: 12 (DW_TAG_member)
     <25e>   DW_AT_name        : (strp) (offset: 0x1075): tp_call
@@ -320,50 +320,50 @@
     <26b>   DW_AT_name        : (strp) (offset: 0x1114): tp_str
     <26f>   DW_AT_decl_file   : (data1) 10
     <270>   DW_AT_decl_line   : (data1) 216
     <271>   DW_AT_decl_column : (data1) 14
     <272>   DW_AT_type        : (ref4) <0x6f9>, reprfunc
     <276>   DW_AT_data_member_location: (data1) 136
  <2><277>: Abbrev Number: 12 (DW_TAG_member)
-    <278>   DW_AT_name        : (strp) (offset: 0x2ff6): tp_getattro
+    <278>   DW_AT_name        : (strp) (offset: 0x2ffc): tp_getattro
     <27c>   DW_AT_decl_file   : (data1) 10
     <27d>   DW_AT_decl_line   : (data1) 217
     <27e>   DW_AT_decl_column : (data1) 18
     <27f>   DW_AT_type        : (ref4) <0x6b7>, getattrofunc
     <283>   DW_AT_data_member_location: (data1) 144
  <2><284>: Abbrev Number: 12 (DW_TAG_member)
-    <285>   DW_AT_name        : (strp) (offset: 0x4184): tp_setattro
+    <285>   DW_AT_name        : (strp) (offset: 0x419c): tp_setattro
     <289>   DW_AT_decl_file   : (data1) 10
     <28a>   DW_AT_decl_line   : (data1) 218
     <28b>   DW_AT_decl_column : (data1) 18
     <28c>   DW_AT_type        : (ref4) <0x6ed>, setattrofunc
     <290>   DW_AT_data_member_location: (data1) 152
  <2><291>: Abbrev Number: 12 (DW_TAG_member)
-    <292>   DW_AT_name        : (strp) (offset: 0x2b59): tp_as_buffer
+    <292>   DW_AT_name        : (strp) (offset: 0x2b5f): tp_as_buffer
     <296>   DW_AT_decl_file   : (data1) 10
     <297>   DW_AT_decl_line   : (data1) 221
     <298>   DW_AT_decl_column : (data1) 20
     <299>   DW_AT_type        : (ref4) <0xce1>
     <29d>   DW_AT_data_member_location: (data1) 160
  <2><29e>: Abbrev Number: 12 (DW_TAG_member)
-    <29f>   DW_AT_name        : (strp) (offset: 0x4d41): tp_flags
+    <29f>   DW_AT_name        : (strp) (offset: 0x4d4c): tp_flags
     <2a3>   DW_AT_decl_file   : (data1) 10
     <2a4>   DW_AT_decl_line   : (data1) 224
     <2a5>   DW_AT_decl_column : (data1) 19
     <2a6>   DW_AT_type        : (ref4) <0x36>, long unsigned int
     <2aa>   DW_AT_data_member_location: (data1) 168
  <2><2ab>: Abbrev Number: 12 (DW_TAG_member)
-    <2ac>   DW_AT_name        : (strp) (offset: 0x380a): tp_doc
+    <2ac>   DW_AT_name        : (strp) (offset: 0x3822): tp_doc
     <2b0>   DW_AT_decl_file   : (data1) 10
     <2b1>   DW_AT_decl_line   : (data1) 226
     <2b2>   DW_AT_decl_column : (data1) 17
     <2b3>   DW_AT_type        : (ref4) <0xdf>
     <2b7>   DW_AT_data_member_location: (data1) 176
  <2><2b8>: Abbrev Number: 12 (DW_TAG_member)
-    <2b9>   DW_AT_name        : (strp) (offset: 0x3fef): tp_traverse
+    <2b9>   DW_AT_name        : (strp) (offset: 0x4007): tp_traverse
     <2bd>   DW_AT_decl_file   : (data1) 10
     <2be>   DW_AT_decl_line   : (data1) 230
     <2bf>   DW_AT_decl_column : (data1) 18
     <2c0>   DW_AT_type        : (ref4) <0x630>, traverseproc
     <2c4>   DW_AT_data_member_location: (data1) 184
  <2><2c5>: Abbrev Number: 12 (DW_TAG_member)
     <2c6>   DW_AT_name        : (strp) (offset: 0x1760): tp_clear
@@ -376,78 +376,78 @@
     <2d3>   DW_AT_name        : (strp) (offset: 0xbbe): tp_richcompare
     <2d7>   DW_AT_decl_file   : (data1) 10
     <2d8>   DW_AT_decl_line   : (data1) 237
     <2d9>   DW_AT_decl_column : (data1) 17
     <2da>   DW_AT_type        : (ref4) <0x725>, richcmpfunc
     <2de>   DW_AT_data_member_location: (data1) 200
  <2><2df>: Abbrev Number: 12 (DW_TAG_member)
-    <2e0>   DW_AT_name        : (strp) (offset: 0x36d8): tp_weaklistoffset
+    <2e0>   DW_AT_name        : (strp) (offset: 0x36f0): tp_weaklistoffset
     <2e4>   DW_AT_decl_file   : (data1) 10
     <2e5>   DW_AT_decl_line   : (data1) 240
     <2e6>   DW_AT_decl_column : (data1) 16
     <2e7>   DW_AT_type        : (ref4) <0x15e>, Py_ssize_t, ssize_t, __ssize_t, long int
     <2eb>   DW_AT_data_member_location: (data1) 208
  <2><2ec>: Abbrev Number: 12 (DW_TAG_member)
-    <2ed>   DW_AT_name        : (strp) (offset: 0x4387): tp_iter
+    <2ed>   DW_AT_name        : (strp) (offset: 0x439f): tp_iter
     <2f1>   DW_AT_decl_file   : (data1) 10
     <2f2>   DW_AT_decl_line   : (data1) 243
     <2f3>   DW_AT_decl_column : (data1) 17
     <2f4>   DW_AT_type        : (ref4) <0x74f>, getiterfunc
     <2f8>   DW_AT_data_member_location: (data1) 216
  <2><2f9>: Abbrev Number: 12 (DW_TAG_member)
-    <2fa>   DW_AT_name        : (strp) (offset: 0x42c3): tp_iternext
+    <2fa>   DW_AT_name        : (strp) (offset: 0x42db): tp_iternext
     <2fe>   DW_AT_decl_file   : (data1) 10
     <2ff>   DW_AT_decl_line   : (data1) 244
     <300>   DW_AT_decl_column : (data1) 18
     <301>   DW_AT_type        : (ref4) <0x75b>, iternextfunc
     <305>   DW_AT_data_member_location: (data1) 224
  <2><306>: Abbrev Number: 12 (DW_TAG_member)
-    <307>   DW_AT_name        : (strp) (offset: 0x30d5): tp_methods
+    <307>   DW_AT_name        : (strp) (offset: 0x30db): tp_methods
     <30b>   DW_AT_decl_file   : (data1) 10
     <30c>   DW_AT_decl_line   : (data1) 247
     <30d>   DW_AT_decl_column : (data1) 25
     <30e>   DW_AT_type        : (ref4) <0xd28>
     <312>   DW_AT_data_member_location: (data1) 232
  <2><313>: Abbrev Number: 12 (DW_TAG_member)
-    <314>   DW_AT_name        : (strp) (offset: 0x3fdf): tp_members
+    <314>   DW_AT_name        : (strp) (offset: 0x3ff7): tp_members
     <318>   DW_AT_decl_file   : (data1) 10
     <319>   DW_AT_decl_line   : (data1) 248
     <31a>   DW_AT_decl_column : (data1) 25
     <31b>   DW_AT_type        : (ref4) <0xd7c>
     <31f>   DW_AT_data_member_location: (data1) 240
  <2><320>: Abbrev Number: 12 (DW_TAG_member)
-    <321>   DW_AT_name        : (strp) (offset: 0x4250): tp_getset
+    <321>   DW_AT_name        : (strp) (offset: 0x4268): tp_getset
     <325>   DW_AT_decl_file   : (data1) 10
     <326>   DW_AT_decl_line   : (data1) 249
     <327>   DW_AT_decl_column : (data1) 25
     <328>   DW_AT_type        : (ref4) <0xdd0>
     <32c>   DW_AT_data_member_location: (data1) 248
  <2><32d>: Abbrev Number: 61 (DW_TAG_member)
-    <32e>   DW_AT_name        : (strp) (offset: 0x44d9): tp_base
+    <32e>   DW_AT_name        : (strp) (offset: 0x44f1): tp_base
     <332>   DW_AT_decl_file   : (data1) 10
     <333>   DW_AT_decl_line   : (data1) 251
     <334>   DW_AT_decl_column : (data1) 25
     <335>   DW_AT_type        : (ref4) <0xdd5>
     <339>   DW_AT_data_member_location: (data2) 256
  <2><33b>: Abbrev Number: 61 (DW_TAG_member)
-    <33c>   DW_AT_name        : (strp) (offset: 0x1a51): tp_dict
+    <33c>   DW_AT_name        : (strp) (offset: 0x1a42): tp_dict
     <340>   DW_AT_decl_file   : (data1) 10
     <341>   DW_AT_decl_line   : (data1) 252
     <342>   DW_AT_decl_column : (data1) 15
     <343>   DW_AT_type        : (ref4) <0x4d4>
     <347>   DW_AT_data_member_location: (data2) 264
  <2><349>: Abbrev Number: 61 (DW_TAG_member)
-    <34a>   DW_AT_name        : (strp) (offset: 0x4361): tp_descr_get
+    <34a>   DW_AT_name        : (strp) (offset: 0x4379): tp_descr_get
     <34e>   DW_AT_decl_file   : (data1) 10
     <34f>   DW_AT_decl_line   : (data1) 253
     <350>   DW_AT_decl_column : (data1) 18
     <351>   DW_AT_type        : (ref4) <0x767>, descrgetfunc
     <355>   DW_AT_data_member_location: (data2) 272
  <2><357>: Abbrev Number: 61 (DW_TAG_member)
-    <358>   DW_AT_name        : (strp) (offset: 0x51b2): tp_descr_set
+    <358>   DW_AT_name        : (strp) (offset: 0x51bd): tp_descr_set
     <35c>   DW_AT_decl_file   : (data1) 10
     <35d>   DW_AT_decl_line   : (data1) 254
     <35e>   DW_AT_decl_column : (data1) 18
     <35f>   DW_AT_type        : (ref4) <0x773>, descrsetfunc
     <363>   DW_AT_data_member_location: (data2) 280
  <2><365>: Abbrev Number: 61 (DW_TAG_member)
     <366>   DW_AT_name        : (strp) (offset: 0x15ec): tp_dictoffset
@@ -460,22 +460,22 @@
     <374>   DW_AT_name        : (strp) (offset: 0x19a0): tp_init
     <378>   DW_AT_decl_file   : (data1) 10
     <379>   DW_AT_decl_line   : (data2) 256
     <37b>   DW_AT_decl_column : (data1) 14
     <37c>   DW_AT_type        : (ref4) <0x77f>, initproc
     <380>   DW_AT_data_member_location: (data2) 296
  <2><382>: Abbrev Number: 18 (DW_TAG_member)
-    <383>   DW_AT_name        : (strp) (offset: 0x2dd9): tp_alloc
+    <383>   DW_AT_name        : (strp) (offset: 0x2ddf): tp_alloc
     <387>   DW_AT_decl_file   : (data1) 10
     <388>   DW_AT_decl_line   : (data2) 257
     <38a>   DW_AT_decl_column : (data1) 15
     <38b>   DW_AT_type        : (ref4) <0x7b5>, allocfunc
     <38f>   DW_AT_data_member_location: (data2) 304
  <2><391>: Abbrev Number: 18 (DW_TAG_member)
-    <392>   DW_AT_name        : (strp) (offset: 0x2778): tp_new
+    <392>   DW_AT_name        : (strp) (offset: 0x278f): tp_new
     <396>   DW_AT_decl_file   : (data1) 10
     <397>   DW_AT_decl_line   : (data2) 258
     <399>   DW_AT_decl_column : (data1) 13
     <39a>   DW_AT_type        : (ref4) <0x78b>, newfunc
     <39e>   DW_AT_data_member_location: (data2) 312
  <2><3a0>: Abbrev Number: 18 (DW_TAG_member)
     <3a1>   DW_AT_name        : (strp) (offset: 0xe65): tp_free
@@ -495,64 +495,64 @@
     <3bf>   DW_AT_name        : (strp) (offset: 0x6da): tp_bases
     <3c3>   DW_AT_decl_file   : (data1) 10
     <3c4>   DW_AT_decl_line   : (data2) 261
     <3c6>   DW_AT_decl_column : (data1) 15
     <3c7>   DW_AT_type        : (ref4) <0x4d4>
     <3cb>   DW_AT_data_member_location: (data2) 336
  <2><3cd>: Abbrev Number: 18 (DW_TAG_member)
-    <3ce>   DW_AT_name        : (strp) (offset: 0x3114): tp_mro
+    <3ce>   DW_AT_name        : (strp) (offset: 0x311a): tp_mro
     <3d2>   DW_AT_decl_file   : (data1) 10
     <3d3>   DW_AT_decl_line   : (data2) 262
     <3d5>   DW_AT_decl_column : (data1) 15
     <3d6>   DW_AT_type        : (ref4) <0x4d4>
     <3da>   DW_AT_data_member_location: (data2) 344
  <2><3dc>: Abbrev Number: 18 (DW_TAG_member)
-    <3dd>   DW_AT_name        : (strp) (offset: 0x4a6f): tp_cache
+    <3dd>   DW_AT_name        : (strp) (offset: 0x4a7a): tp_cache
     <3e1>   DW_AT_decl_file   : (data1) 10
     <3e2>   DW_AT_decl_line   : (data2) 263
     <3e4>   DW_AT_decl_column : (data1) 15
     <3e5>   DW_AT_type        : (ref4) <0x4d4>
     <3e9>   DW_AT_data_member_location: (data2) 352
  <2><3eb>: Abbrev Number: 18 (DW_TAG_member)
-    <3ec>   DW_AT_name        : (strp) (offset: 0x4109): tp_subclasses
+    <3ec>   DW_AT_name        : (strp) (offset: 0x4121): tp_subclasses
     <3f0>   DW_AT_decl_file   : (data1) 10
     <3f1>   DW_AT_decl_line   : (data2) 264
     <3f3>   DW_AT_decl_column : (data1) 15
     <3f4>   DW_AT_type        : (ref4) <0x4d4>
     <3f8>   DW_AT_data_member_location: (data2) 360
  <2><3fa>: Abbrev Number: 18 (DW_TAG_member)
-    <3fb>   DW_AT_name        : (strp) (offset: 0x399e): tp_weaklist
+    <3fb>   DW_AT_name        : (strp) (offset: 0x39b6): tp_weaklist
     <3ff>   DW_AT_decl_file   : (data1) 10
     <400>   DW_AT_decl_line   : (data2) 265
     <402>   DW_AT_decl_column : (data1) 15
     <403>   DW_AT_type        : (ref4) <0x4d4>
     <407>   DW_AT_data_member_location: (data2) 368
  <2><409>: Abbrev Number: 18 (DW_TAG_member)
-    <40a>   DW_AT_name        : (strp) (offset: 0x2964): tp_del
+    <40a>   DW_AT_name        : (strp) (offset: 0x297b): tp_del
     <40e>   DW_AT_decl_file   : (data1) 10
     <40f>   DW_AT_decl_line   : (data2) 266
     <411>   DW_AT_decl_column : (data1) 16
     <412>   DW_AT_type        : (ref4) <0x676>, destructor
     <416>   DW_AT_data_member_location: (data2) 376
  <2><418>: Abbrev Number: 18 (DW_TAG_member)
-    <419>   DW_AT_name        : (strp) (offset: 0x3dce): tp_version_tag
+    <419>   DW_AT_name        : (strp) (offset: 0x3de6): tp_version_tag
     <41d>   DW_AT_decl_file   : (data1) 10
     <41e>   DW_AT_decl_line   : (data2) 269
     <420>   DW_AT_decl_column : (data1) 18
     <421>   DW_AT_type        : (ref4) <0x42>, unsigned int
     <425>   DW_AT_data_member_location: (data2) 384
  <2><427>: Abbrev Number: 18 (DW_TAG_member)
     <428>   DW_AT_name        : (strp) (offset: 0x1677): tp_finalize
     <42c>   DW_AT_decl_file   : (data1) 10
     <42d>   DW_AT_decl_line   : (data2) 271
     <42f>   DW_AT_decl_column : (data1) 16
     <430>   DW_AT_type        : (ref4) <0x676>, destructor
     <434>   DW_AT_data_member_location: (data2) 392
  <2><436>: Abbrev Number: 18 (DW_TAG_member)
-    <437>   DW_AT_name        : (strp) (offset: 0x3d33): tp_vectorcall
+    <437>   DW_AT_name        : (strp) (offset: 0x3d4b): tp_vectorcall
     <43b>   DW_AT_decl_file   : (data1) 10
     <43c>   DW_AT_decl_line   : (data2) 272
     <43e>   DW_AT_decl_column : (data1) 20
     <43f>   DW_AT_type        : (ref4) <0x92c>, vectorcallfunc
     <443>   DW_AT_data_member_location: (data2) 400
  <2><445>: Abbrev Number: 0
  <1><446>: Abbrev Number: 59 (DW_TAG_structure_type)
@@ -577,15 +577,15 @@
     <468>   DW_AT_type        : (ref4) <0x46e>
     <46c>   DW_AT_data_member_location: (data1) 8
  <2><46d>: Abbrev Number: 0
  <1><46e>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <46f>   DW_AT_byte_size   : (implicit_const) 8
     <46f>   DW_AT_type        : (ref4) <0x189>, PyTypeObject, _typeobject
  <1><473>: Abbrev Number: 22 (DW_TAG_typedef)
-    <474>   DW_AT_name        : (strp) (offset: 0x2270): PyObject
+    <474>   DW_AT_name        : (strp) (offset: 0x2287): PyObject
     <478>   DW_AT_decl_file   : (data1) 2
     <479>   DW_AT_decl_line   : (data1) 109
     <47a>   DW_AT_decl_column : (data1) 3
     <47b>   DW_AT_type        : (ref4) <0x446>, _object
  <1><47f>: Abbrev Number: 42 (DW_TAG_const_type)
     <480>   DW_AT_type        : (ref4) <0x473>, PyObject, _object
  <1><484>: Abbrev Number: 54 (DW_TAG_structure_type)
@@ -612,15 +612,15 @@
  <1><4a8>: Abbrev Number: 22 (DW_TAG_typedef)
     <4a9>   DW_AT_name        : (strp) (offset: 0xf1c): PyVarObject
     <4ad>   DW_AT_decl_file   : (data1) 2
     <4ae>   DW_AT_decl_line   : (data1) 118
     <4af>   DW_AT_decl_column : (data1) 3
     <4b0>   DW_AT_type        : (ref4) <0x484>
  <1><4b4>: Abbrev Number: 22 (DW_TAG_typedef)
-    <4b5>   DW_AT_name        : (strp) (offset: 0x325b): unaryfunc
+    <4b5>   DW_AT_name        : (strp) (offset: 0x3273): unaryfunc
     <4b9>   DW_AT_decl_file   : (data1) 2
     <4ba>   DW_AT_decl_line   : (data1) 184
     <4bb>   DW_AT_decl_column : (data1) 22
     <4bc>   DW_AT_type        : (ref4) <0x4c0>
  <1><4c0>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <4c1>   DW_AT_byte_size   : (implicit_const) 8
     <4c1>   DW_AT_type        : (ref4) <0x4c5>
@@ -633,15 +633,15 @@
  <2><4d3>: Abbrev Number: 0
  <1><4d4>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <4d5>   DW_AT_byte_size   : (implicit_const) 8
     <4d5>   DW_AT_type        : (ref4) <0x473>, PyObject, _object
  <1><4d9>: Abbrev Number: 42 (DW_TAG_const_type)
     <4da>   DW_AT_type        : (ref4) <0x4d4>
  <1><4de>: Abbrev Number: 22 (DW_TAG_typedef)
-    <4df>   DW_AT_name        : (strp) (offset: 0x1b7b): binaryfunc
+    <4df>   DW_AT_name        : (strp) (offset: 0x1b80): binaryfunc
     <4e3>   DW_AT_decl_file   : (data1) 2
     <4e4>   DW_AT_decl_line   : (data1) 185
     <4e5>   DW_AT_decl_column : (data1) 22
     <4e6>   DW_AT_type        : (ref4) <0x4ea>
  <1><4ea>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <4eb>   DW_AT_byte_size   : (implicit_const) 8
     <4eb>   DW_AT_type        : (ref4) <0x4ef>
@@ -671,15 +671,15 @@
     <51e>   DW_AT_type        : (ref4) <0x4d4>
  <2><522>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <523>   DW_AT_type        : (ref4) <0x4d4>
  <2><527>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <528>   DW_AT_type        : (ref4) <0x4d4>
  <2><52c>: Abbrev Number: 0
  <1><52d>: Abbrev Number: 22 (DW_TAG_typedef)
-    <52e>   DW_AT_name        : (strp) (offset: 0x3447): inquiry
+    <52e>   DW_AT_name        : (strp) (offset: 0x345f): inquiry
     <532>   DW_AT_decl_file   : (data1) 2
     <533>   DW_AT_decl_line   : (data1) 187
     <534>   DW_AT_decl_column : (data1) 15
     <535>   DW_AT_type        : (ref4) <0x539>
  <1><539>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <53a>   DW_AT_byte_size   : (implicit_const) 8
     <53a>   DW_AT_type        : (ref4) <0x53e>, int
@@ -703,15 +703,15 @@
     <55f>   DW_AT_prototyped  : (flag_present) 1
     <55f>   DW_AT_type        : (ref4) <0x15e>, Py_ssize_t, ssize_t, __ssize_t, long int
     <563>   DW_AT_sibling     : (ref4) <0x56d>
  <2><567>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <568>   DW_AT_type        : (ref4) <0x4d4>
  <2><56c>: Abbrev Number: 0
  <1><56d>: Abbrev Number: 22 (DW_TAG_typedef)
-    <56e>   DW_AT_name        : (strp) (offset: 0x1d1d): ssizeargfunc
+    <56e>   DW_AT_name        : (strp) (offset: 0x1d22): ssizeargfunc
     <572>   DW_AT_decl_file   : (data1) 2
     <573>   DW_AT_decl_line   : (data1) 189
     <574>   DW_AT_decl_column : (data1) 21
     <575>   DW_AT_type        : (ref4) <0x579>
  <1><579>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <57a>   DW_AT_byte_size   : (implicit_const) 8
     <57a>   DW_AT_type        : (ref4) <0x57e>
@@ -721,15 +721,15 @@
     <583>   DW_AT_sibling     : (ref4) <0x592>
  <2><587>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <588>   DW_AT_type        : (ref4) <0x4d4>
  <2><58c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <58d>   DW_AT_type        : (ref4) <0x15e>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><591>: Abbrev Number: 0
  <1><592>: Abbrev Number: 22 (DW_TAG_typedef)
-    <593>   DW_AT_name        : (strp) (offset: 0x3cde): ssizeobjargproc
+    <593>   DW_AT_name        : (strp) (offset: 0x3cf6): ssizeobjargproc
     <597>   DW_AT_decl_file   : (data1) 2
     <598>   DW_AT_decl_line   : (data1) 191
     <599>   DW_AT_decl_column : (data1) 14
     <59a>   DW_AT_type        : (ref4) <0x59e>
  <1><59e>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <59f>   DW_AT_byte_size   : (implicit_const) 8
     <59f>   DW_AT_type        : (ref4) <0x5a3>, int
@@ -761,15 +761,15 @@
     <5d7>   DW_AT_type        : (ref4) <0x4d4>
  <2><5db>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <5dc>   DW_AT_type        : (ref4) <0x4d4>
  <2><5e0>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <5e1>   DW_AT_type        : (ref4) <0x4d4>
  <2><5e5>: Abbrev Number: 0
  <1><5e6>: Abbrev Number: 22 (DW_TAG_typedef)
-    <5e7>   DW_AT_name        : (strp) (offset: 0x5301): objobjproc
+    <5e7>   DW_AT_name        : (strp) (offset: 0x530c): objobjproc
     <5eb>   DW_AT_decl_file   : (data1) 2
     <5ec>   DW_AT_decl_line   : (data1) 195
     <5ed>   DW_AT_decl_column : (data1) 15
     <5ee>   DW_AT_type        : (ref4) <0x5f2>
  <1><5f2>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <5f3>   DW_AT_byte_size   : (implicit_const) 8
     <5f3>   DW_AT_type        : (ref4) <0x5f7>, int
@@ -797,15 +797,15 @@
     <621>   DW_AT_sibling     : (ref4) <0x630>
  <2><625>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <626>   DW_AT_type        : (ref4) <0x4d4>
  <2><62a>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <62b>   DW_AT_type        : (ref4) <0x49>
  <2><62f>: Abbrev Number: 0
  <1><630>: Abbrev Number: 22 (DW_TAG_typedef)
-    <631>   DW_AT_name        : (strp) (offset: 0x33b1): traverseproc
+    <631>   DW_AT_name        : (strp) (offset: 0x33c9): traverseproc
     <635>   DW_AT_decl_file   : (data1) 2
     <636>   DW_AT_decl_line   : (data1) 197
     <637>   DW_AT_decl_column : (data1) 15
     <638>   DW_AT_type        : (ref4) <0x63c>
  <1><63c>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <63d>   DW_AT_byte_size   : (implicit_const) 8
     <63d>   DW_AT_type        : (ref4) <0x641>, int
@@ -817,45 +817,45 @@
     <64b>   DW_AT_type        : (ref4) <0x4d4>
  <2><64f>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <650>   DW_AT_type        : (ref4) <0x60b>, visitproc
  <2><654>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <655>   DW_AT_type        : (ref4) <0x49>
  <2><659>: Abbrev Number: 0
  <1><65a>: Abbrev Number: 22 (DW_TAG_typedef)
-    <65b>   DW_AT_name        : (strp) (offset: 0x419a): freefunc
+    <65b>   DW_AT_name        : (strp) (offset: 0x41b2): freefunc
     <65f>   DW_AT_decl_file   : (data1) 2
     <660>   DW_AT_decl_line   : (data1) 200
     <661>   DW_AT_decl_column : (data1) 16
     <662>   DW_AT_type        : (ref4) <0x666>
  <1><666>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <667>   DW_AT_byte_size   : (implicit_const) 8
     <667>   DW_AT_type        : (ref4) <0x66b>
  <1><66b>: Abbrev Number: 80 (DW_TAG_subroutine_type)
     <66c>   DW_AT_prototyped  : (flag_present) 1
     <66c>   DW_AT_sibling     : (ref4) <0x676>
  <2><670>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <671>   DW_AT_type        : (ref4) <0x49>
  <2><675>: Abbrev Number: 0
  <1><676>: Abbrev Number: 22 (DW_TAG_typedef)
-    <677>   DW_AT_name        : (strp) (offset: 0x2863): destructor
+    <677>   DW_AT_name        : (strp) (offset: 0x287a): destructor
     <67b>   DW_AT_decl_file   : (data1) 2
     <67c>   DW_AT_decl_line   : (data1) 201
     <67d>   DW_AT_decl_column : (data1) 16
     <67e>   DW_AT_type        : (ref4) <0x682>
  <1><682>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <683>   DW_AT_byte_size   : (implicit_const) 8
     <683>   DW_AT_type        : (ref4) <0x687>
  <1><687>: Abbrev Number: 80 (DW_TAG_subroutine_type)
     <688>   DW_AT_prototyped  : (flag_present) 1
     <688>   DW_AT_sibling     : (ref4) <0x692>
  <2><68c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <68d>   DW_AT_type        : (ref4) <0x4d4>
  <2><691>: Abbrev Number: 0
  <1><692>: Abbrev Number: 22 (DW_TAG_typedef)
-    <693>   DW_AT_name        : (strp) (offset: 0x3a6e): getattrfunc
+    <693>   DW_AT_name        : (strp) (offset: 0x3a86): getattrfunc
     <697>   DW_AT_decl_file   : (data1) 2
     <698>   DW_AT_decl_line   : (data1) 202
     <699>   DW_AT_decl_column : (data1) 21
     <69a>   DW_AT_type        : (ref4) <0x69e>
  <1><69e>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <69f>   DW_AT_byte_size   : (implicit_const) 8
     <69f>   DW_AT_type        : (ref4) <0x6a3>
@@ -865,21 +865,21 @@
     <6a8>   DW_AT_sibling     : (ref4) <0x6b7>
  <2><6ac>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <6ad>   DW_AT_type        : (ref4) <0x4d4>
  <2><6b1>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <6b2>   DW_AT_type        : (ref4) <0xce>
  <2><6b6>: Abbrev Number: 0
  <1><6b7>: Abbrev Number: 22 (DW_TAG_typedef)
-    <6b8>   DW_AT_name        : (strp) (offset: 0x3811): getattrofunc
+    <6b8>   DW_AT_name        : (strp) (offset: 0x3829): getattrofunc
     <6bc>   DW_AT_decl_file   : (data1) 2
     <6bd>   DW_AT_decl_line   : (data1) 203
     <6be>   DW_AT_decl_column : (data1) 21
     <6bf>   DW_AT_type        : (ref4) <0x4ea>
  <1><6c3>: Abbrev Number: 22 (DW_TAG_typedef)
-    <6c4>   DW_AT_name        : (strp) (offset: 0x1a8a): setattrfunc
+    <6c4>   DW_AT_name        : (strp) (offset: 0x1a7b): setattrfunc
     <6c8>   DW_AT_decl_file   : (data1) 2
     <6c9>   DW_AT_decl_line   : (data1) 204
     <6ca>   DW_AT_decl_column : (data1) 15
     <6cb>   DW_AT_type        : (ref4) <0x6cf>
  <1><6cf>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <6d0>   DW_AT_byte_size   : (implicit_const) 8
     <6d0>   DW_AT_type        : (ref4) <0x6d4>, int
@@ -897,21 +897,21 @@
  <1><6ed>: Abbrev Number: 22 (DW_TAG_typedef)
     <6ee>   DW_AT_name        : (strp) (offset: 0x85b): setattrofunc
     <6f2>   DW_AT_decl_file   : (data1) 2
     <6f3>   DW_AT_decl_line   : (data1) 205
     <6f4>   DW_AT_decl_column : (data1) 15
     <6f5>   DW_AT_type        : (ref4) <0x5c8>
  <1><6f9>: Abbrev Number: 22 (DW_TAG_typedef)
-    <6fa>   DW_AT_name        : (strp) (offset: 0x1fa7): reprfunc
+    <6fa>   DW_AT_name        : (strp) (offset: 0x1fbe): reprfunc
     <6fe>   DW_AT_decl_file   : (data1) 2
     <6ff>   DW_AT_decl_line   : (data1) 206
     <700>   DW_AT_decl_column : (data1) 21
     <701>   DW_AT_type        : (ref4) <0x4c0>
  <1><705>: Abbrev Number: 22 (DW_TAG_typedef)
-    <706>   DW_AT_name        : (strp) (offset: 0x3a65): hashfunc
+    <706>   DW_AT_name        : (strp) (offset: 0x3a7d): hashfunc
     <70a>   DW_AT_decl_file   : (data1) 2
     <70b>   DW_AT_decl_line   : (data1) 207
     <70c>   DW_AT_decl_column : (data1) 21
     <70d>   DW_AT_type        : (ref4) <0x711>
  <1><711>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <712>   DW_AT_byte_size   : (implicit_const) 8
     <712>   DW_AT_type        : (ref4) <0x716>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
@@ -939,45 +939,45 @@
     <740>   DW_AT_type        : (ref4) <0x4d4>
  <2><744>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <745>   DW_AT_type        : (ref4) <0x4d4>
  <2><749>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <74a>   DW_AT_type        : (ref4) <0x90>, int
  <2><74e>: Abbrev Number: 0
  <1><74f>: Abbrev Number: 22 (DW_TAG_typedef)
-    <750>   DW_AT_name        : (strp) (offset: 0x1d11): getiterfunc
+    <750>   DW_AT_name        : (strp) (offset: 0x1d16): getiterfunc
     <754>   DW_AT_decl_file   : (data1) 2
     <755>   DW_AT_decl_line   : (data1) 209
     <756>   DW_AT_decl_column : (data1) 21
     <757>   DW_AT_type        : (ref4) <0x4c0>
  <1><75b>: Abbrev Number: 22 (DW_TAG_typedef)
-    <75c>   DW_AT_name        : (strp) (offset: 0x50a9): iternextfunc
+    <75c>   DW_AT_name        : (strp) (offset: 0x50b4): iternextfunc
     <760>   DW_AT_decl_file   : (data1) 2
     <761>   DW_AT_decl_line   : (data1) 210
     <762>   DW_AT_decl_column : (data1) 21
     <763>   DW_AT_type        : (ref4) <0x4c0>
  <1><767>: Abbrev Number: 22 (DW_TAG_typedef)
-    <768>   DW_AT_name        : (strp) (offset: 0x1e21): descrgetfunc
+    <768>   DW_AT_name        : (strp) (offset: 0x1e26): descrgetfunc
     <76c>   DW_AT_decl_file   : (data1) 2
     <76d>   DW_AT_decl_line   : (data1) 211
     <76e>   DW_AT_decl_column : (data1) 21
     <76f>   DW_AT_type        : (ref4) <0x50f>
  <1><773>: Abbrev Number: 22 (DW_TAG_typedef)
-    <774>   DW_AT_name        : (strp) (offset: 0x1d93): descrsetfunc
+    <774>   DW_AT_name        : (strp) (offset: 0x1d98): descrsetfunc
     <778>   DW_AT_decl_file   : (data1) 2
     <779>   DW_AT_decl_line   : (data1) 212
     <77a>   DW_AT_decl_column : (data1) 15
     <77b>   DW_AT_type        : (ref4) <0x5c8>
  <1><77f>: Abbrev Number: 22 (DW_TAG_typedef)
     <780>   DW_AT_name        : (strp) (offset: 0x660): initproc
     <784>   DW_AT_decl_file   : (data1) 2
     <785>   DW_AT_decl_line   : (data1) 213
     <786>   DW_AT_decl_column : (data1) 15
     <787>   DW_AT_type        : (ref4) <0x5c8>
  <1><78b>: Abbrev Number: 22 (DW_TAG_typedef)
-    <78c>   DW_AT_name        : (strp) (offset: 0x3a5d): newfunc
+    <78c>   DW_AT_name        : (strp) (offset: 0x3a75): newfunc
     <790>   DW_AT_decl_file   : (data1) 2
     <791>   DW_AT_decl_line   : (data1) 214
     <792>   DW_AT_decl_column : (data1) 21
     <793>   DW_AT_type        : (ref4) <0x797>
  <1><797>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <798>   DW_AT_byte_size   : (implicit_const) 8
     <798>   DW_AT_type        : (ref4) <0x79c>
@@ -989,15 +989,15 @@
     <7a6>   DW_AT_type        : (ref4) <0x46e>
  <2><7aa>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <7ab>   DW_AT_type        : (ref4) <0x4d4>
  <2><7af>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <7b0>   DW_AT_type        : (ref4) <0x4d4>
  <2><7b4>: Abbrev Number: 0
  <1><7b5>: Abbrev Number: 22 (DW_TAG_typedef)
-    <7b6>   DW_AT_name        : (strp) (offset: 0x301a): allocfunc
+    <7b6>   DW_AT_name        : (strp) (offset: 0x3020): allocfunc
     <7ba>   DW_AT_decl_file   : (data1) 2
     <7bb>   DW_AT_decl_line   : (data1) 215
     <7bc>   DW_AT_decl_column : (data1) 21
     <7bd>   DW_AT_type        : (ref4) <0x7c1>
  <1><7c1>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <7c2>   DW_AT_byte_size   : (implicit_const) 8
     <7c2>   DW_AT_type        : (ref4) <0x7c6>
@@ -1007,15 +1007,15 @@
     <7cb>   DW_AT_sibling     : (ref4) <0x7da>
  <2><7cf>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <7d0>   DW_AT_type        : (ref4) <0x46e>
  <2><7d4>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <7d5>   DW_AT_type        : (ref4) <0x15e>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><7d9>: Abbrev Number: 0
  <1><7da>: Abbrev Number: 48 (DW_TAG_variable)
-    <7db>   DW_AT_name        : (strp) (offset: 0x4e77): PyType_Type
+    <7db>   DW_AT_name        : (strp) (offset: 0x4e82): PyType_Type
     <7df>   DW_AT_decl_file   : (data1) 2
     <7e0>   DW_AT_decl_line   : (data1) 251
     <7e1>   DW_AT_decl_column : (data1) 26
     <7e2>   DW_AT_type        : (ref4) <0x189>, PyTypeObject, _typeobject
     <7e6>   DW_AT_external    : (flag_present) 1
     <7e6>   DW_AT_declaration : (flag_present) 1
  <1><7e6>: Abbrev Number: 48 (DW_TAG_variable)
@@ -1023,15 +1023,15 @@
     <7eb>   DW_AT_decl_file   : (data1) 2
     <7ec>   DW_AT_decl_line   : (data1) 252
     <7ed>   DW_AT_decl_column : (data1) 26
     <7ee>   DW_AT_type        : (ref4) <0x189>, PyTypeObject, _typeobject
     <7f2>   DW_AT_external    : (flag_present) 1
     <7f2>   DW_AT_declaration : (flag_present) 1
  <1><7f2>: Abbrev Number: 92 (DW_TAG_variable)
-    <7f3>   DW_AT_name        : (strp) (offset: 0x4b92): _Py_NoneStruct
+    <7f3>   DW_AT_name        : (strp) (offset: 0x4b9d): _Py_NoneStruct
     <7f7>   DW_AT_decl_file   : (data1) 2
     <7f8>   DW_AT_decl_line   : (data2) 605
     <7fa>   DW_AT_decl_column : (data1) 22
     <7fb>   DW_AT_type        : (ref4) <0x473>, PyObject, _object
     <7ff>   DW_AT_external    : (flag_present) 1
     <7ff>   DW_AT_declaration : (flag_present) 1
  <1><7ff>: Abbrev Number: 104 (DW_TAG_enumeration_type)
@@ -1039,31 +1039,31 @@
     <801>   DW_AT_byte_size   : (data1) 4
     <802>   DW_AT_type        : (ref4) <0x90>, int
     <806>   DW_AT_decl_file   : (data1) 2
     <807>   DW_AT_decl_line   : (data2) 635
     <809>   DW_AT_decl_column : (data1) 14
     <80a>   DW_AT_sibling     : (ref4) <0x821>
  <2><80e>: Abbrev Number: 72 (DW_TAG_enumerator)
-    <80f>   DW_AT_name        : (strp) (offset: 0x33a4): PYGEN_RETURN
+    <80f>   DW_AT_name        : (strp) (offset: 0x33bc): PYGEN_RETURN
     <813>   DW_AT_const_value : (data1) 0
  <2><814>: Abbrev Number: 105 (DW_TAG_enumerator)
-    <815>   DW_AT_name        : (strp) (offset: 0x4ab2): PYGEN_ERROR
+    <815>   DW_AT_name        : (strp) (offset: 0x4abd): PYGEN_ERROR
     <819>   DW_AT_const_value : (sdata) -1
  <2><81a>: Abbrev Number: 72 (DW_TAG_enumerator)
-    <81b>   DW_AT_name        : (strp) (offset: 0x52f6): PYGEN_NEXT
+    <81b>   DW_AT_name        : (strp) (offset: 0x5301): PYGEN_NEXT
     <81f>   DW_AT_const_value : (data1) 1
  <2><820>: Abbrev Number: 0
  <1><821>: Abbrev Number: 67 (DW_TAG_typedef)
-    <822>   DW_AT_name        : (strp) (offset: 0x3656): PySendResult
+    <822>   DW_AT_name        : (strp) (offset: 0x366e): PySendResult
     <826>   DW_AT_decl_file   : (data1) 2
     <827>   DW_AT_decl_line   : (data2) 639
     <829>   DW_AT_decl_column : (data1) 3
     <82a>   DW_AT_type        : (ref4) <0x7ff>, int
  <1><82e>: Abbrev Number: 59 (DW_TAG_structure_type)
-    <82f>   DW_AT_name        : (strp) (offset: 0x39cc): bufferinfo
+    <82f>   DW_AT_name        : (strp) (offset: 0x39e4): bufferinfo
     <833>   DW_AT_byte_size   : (data1) 80
     <834>   DW_AT_decl_file   : (data1) 10
     <835>   DW_AT_decl_line   : (data1) 49
     <836>   DW_AT_decl_column : (data1) 16
     <837>   DW_AT_sibling     : (ref4) <0x8cb>
  <2><83b>: Abbrev Number: 70 (DW_TAG_member)
     <83c>   DW_AT_name        : (string) buf
@@ -1090,74 +1090,74 @@
     <863>   DW_AT_name        : (strp) (offset: 0x586): itemsize
     <867>   DW_AT_decl_file   : (data1) 10
     <868>   DW_AT_decl_line   : (data1) 53
     <869>   DW_AT_decl_column : (data1) 16
     <86a>   DW_AT_type        : (ref4) <0x15e>, Py_ssize_t, ssize_t, __ssize_t, long int
     <86e>   DW_AT_data_member_location: (data1) 24
  <2><86f>: Abbrev Number: 12 (DW_TAG_member)
-    <870>   DW_AT_name        : (strp) (offset: 0x37fb): readonly
+    <870>   DW_AT_name        : (strp) (offset: 0x3813): readonly
     <874>   DW_AT_decl_file   : (data1) 10
     <875>   DW_AT_decl_line   : (data1) 55
     <876>   DW_AT_decl_column : (data1) 9
     <877>   DW_AT_type        : (ref4) <0x90>, int
     <87b>   DW_AT_data_member_location: (data1) 32
  <2><87c>: Abbrev Number: 12 (DW_TAG_member)
-    <87d>   DW_AT_name        : (strp) (offset: 0x3cd9): ndim
+    <87d>   DW_AT_name        : (strp) (offset: 0x3cf1): ndim
     <881>   DW_AT_decl_file   : (data1) 10
     <882>   DW_AT_decl_line   : (data1) 56
     <883>   DW_AT_decl_column : (data1) 9
     <884>   DW_AT_type        : (ref4) <0x90>, int
     <888>   DW_AT_data_member_location: (data1) 36
  <2><889>: Abbrev Number: 12 (DW_TAG_member)
     <88a>   DW_AT_name        : (strp) (offset: 0x109a): format
     <88e>   DW_AT_decl_file   : (data1) 10
     <88f>   DW_AT_decl_line   : (data1) 57
     <890>   DW_AT_decl_column : (data1) 11
     <891>   DW_AT_type        : (ref4) <0xce>
     <895>   DW_AT_data_member_location: (data1) 40
  <2><896>: Abbrev Number: 12 (DW_TAG_member)
-    <897>   DW_AT_name        : (strp) (offset: 0x3c53): shape
+    <897>   DW_AT_name        : (strp) (offset: 0x3c6b): shape
     <89b>   DW_AT_decl_file   : (data1) 10
     <89c>   DW_AT_decl_line   : (data1) 58
     <89d>   DW_AT_decl_column : (data1) 17
     <89e>   DW_AT_type        : (ref4) <0x8cb>
     <8a2>   DW_AT_data_member_location: (data1) 48
  <2><8a3>: Abbrev Number: 12 (DW_TAG_member)
-    <8a4>   DW_AT_name        : (strp) (offset: 0x4455): strides
+    <8a4>   DW_AT_name        : (strp) (offset: 0x446d): strides
     <8a8>   DW_AT_decl_file   : (data1) 10
     <8a9>   DW_AT_decl_line   : (data1) 59
     <8aa>   DW_AT_decl_column : (data1) 17
     <8ab>   DW_AT_type        : (ref4) <0x8cb>
     <8af>   DW_AT_data_member_location: (data1) 56
  <2><8b0>: Abbrev Number: 12 (DW_TAG_member)
-    <8b1>   DW_AT_name        : (strp) (offset: 0x2e0a): suboffsets
+    <8b1>   DW_AT_name        : (strp) (offset: 0x2e10): suboffsets
     <8b5>   DW_AT_decl_file   : (data1) 10
     <8b6>   DW_AT_decl_line   : (data1) 60
     <8b7>   DW_AT_decl_column : (data1) 17
     <8b8>   DW_AT_type        : (ref4) <0x8cb>
     <8bc>   DW_AT_data_member_location: (data1) 64
  <2><8bd>: Abbrev Number: 12 (DW_TAG_member)
-    <8be>   DW_AT_name        : (strp) (offset: 0x485e): internal
+    <8be>   DW_AT_name        : (strp) (offset: 0x4869): internal
     <8c2>   DW_AT_decl_file   : (data1) 10
     <8c3>   DW_AT_decl_line   : (data1) 61
     <8c4>   DW_AT_decl_column : (data1) 11
     <8c5>   DW_AT_type        : (ref4) <0x49>
     <8c9>   DW_AT_data_member_location: (data1) 72
  <2><8ca>: Abbrev Number: 0
  <1><8cb>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <8cc>   DW_AT_byte_size   : (implicit_const) 8
     <8cc>   DW_AT_type        : (ref4) <0x15e>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><8d0>: Abbrev Number: 22 (DW_TAG_typedef)
-    <8d1>   DW_AT_name        : (strp) (offset: 0x51f1): Py_buffer
+    <8d1>   DW_AT_name        : (strp) (offset: 0x51fc): Py_buffer
     <8d5>   DW_AT_decl_file   : (data1) 10
     <8d6>   DW_AT_decl_line   : (data1) 62
     <8d7>   DW_AT_decl_column : (data1) 3
     <8d8>   DW_AT_type        : (ref4) <0x82e>, bufferinfo
  <1><8dc>: Abbrev Number: 22 (DW_TAG_typedef)
-    <8dd>   DW_AT_name        : (strp) (offset: 0x3e80): getbufferproc
+    <8dd>   DW_AT_name        : (strp) (offset: 0x3e98): getbufferproc
     <8e1>   DW_AT_decl_file   : (data1) 10
     <8e2>   DW_AT_decl_line   : (data1) 64
     <8e3>   DW_AT_decl_column : (data1) 15
     <8e4>   DW_AT_type        : (ref4) <0x8e8>
  <1><8e8>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <8e9>   DW_AT_byte_size   : (implicit_const) 8
     <8e9>   DW_AT_type        : (ref4) <0x8ed>, int
@@ -1172,15 +1172,15 @@
  <2><900>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <901>   DW_AT_type        : (ref4) <0x90>, int
  <2><905>: Abbrev Number: 0
  <1><906>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <907>   DW_AT_byte_size   : (implicit_const) 8
     <907>   DW_AT_type        : (ref4) <0x8d0>, Py_buffer, bufferinfo
  <1><90b>: Abbrev Number: 22 (DW_TAG_typedef)
-    <90c>   DW_AT_name        : (strp) (offset: 0x462f): releasebufferproc
+    <90c>   DW_AT_name        : (strp) (offset: 0x4647): releasebufferproc
     <910>   DW_AT_decl_file   : (data1) 10
     <911>   DW_AT_decl_line   : (data1) 65
     <912>   DW_AT_decl_column : (data1) 16
     <913>   DW_AT_type        : (ref4) <0x917>
  <1><917>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <918>   DW_AT_byte_size   : (implicit_const) 8
     <918>   DW_AT_type        : (ref4) <0x91c>
@@ -1189,15 +1189,15 @@
     <91d>   DW_AT_sibling     : (ref4) <0x92c>
  <2><921>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <922>   DW_AT_type        : (ref4) <0x4d4>
  <2><926>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <927>   DW_AT_type        : (ref4) <0x906>
  <2><92b>: Abbrev Number: 0
  <1><92c>: Abbrev Number: 22 (DW_TAG_typedef)
-    <92d>   DW_AT_name        : (strp) (offset: 0x1cf1): vectorcallfunc
+    <92d>   DW_AT_name        : (strp) (offset: 0x1cf6): vectorcallfunc
     <931>   DW_AT_decl_file   : (data1) 10
     <932>   DW_AT_decl_line   : (data1) 67
     <933>   DW_AT_decl_column : (data1) 21
     <934>   DW_AT_type        : (ref4) <0x938>
  <1><938>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <939>   DW_AT_byte_size   : (implicit_const) 8
     <939>   DW_AT_type        : (ref4) <0x93d>
@@ -1227,232 +1227,232 @@
     <96b>   DW_AT_name        : (strp) (offset: 0x258): nb_add
     <96f>   DW_AT_decl_file   : (data1) 10
     <970>   DW_AT_decl_line   : (data1) 109
     <971>   DW_AT_decl_column : (data1) 16
     <972>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <976>   DW_AT_data_member_location: (data1) 0
  <2><977>: Abbrev Number: 12 (DW_TAG_member)
-    <978>   DW_AT_name        : (strp) (offset: 0x4e6b): nb_subtract
+    <978>   DW_AT_name        : (strp) (offset: 0x4e76): nb_subtract
     <97c>   DW_AT_decl_file   : (data1) 10
     <97d>   DW_AT_decl_line   : (data1) 110
     <97e>   DW_AT_decl_column : (data1) 16
     <97f>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <983>   DW_AT_data_member_location: (data1) 8
  <2><984>: Abbrev Number: 12 (DW_TAG_member)
-    <985>   DW_AT_name        : (strp) (offset: 0x41e1): nb_multiply
+    <985>   DW_AT_name        : (strp) (offset: 0x41f9): nb_multiply
     <989>   DW_AT_decl_file   : (data1) 10
     <98a>   DW_AT_decl_line   : (data1) 111
     <98b>   DW_AT_decl_column : (data1) 16
     <98c>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <990>   DW_AT_data_member_location: (data1) 16
  <2><991>: Abbrev Number: 12 (DW_TAG_member)
     <992>   DW_AT_name        : (strp) (offset: 0xc9a): nb_remainder
     <996>   DW_AT_decl_file   : (data1) 10
     <997>   DW_AT_decl_line   : (data1) 112
     <998>   DW_AT_decl_column : (data1) 16
     <999>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <99d>   DW_AT_data_member_location: (data1) 24
  <2><99e>: Abbrev Number: 12 (DW_TAG_member)
-    <99f>   DW_AT_name        : (strp) (offset: 0x52ec): nb_divmod
+    <99f>   DW_AT_name        : (strp) (offset: 0x52f7): nb_divmod
     <9a3>   DW_AT_decl_file   : (data1) 10
     <9a4>   DW_AT_decl_line   : (data1) 113
     <9a5>   DW_AT_decl_column : (data1) 16
     <9a6>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <9aa>   DW_AT_data_member_location: (data1) 32
  <2><9ab>: Abbrev Number: 12 (DW_TAG_member)
     <9ac>   DW_AT_name        : (strp) (offset: 0x44d): nb_power
     <9b0>   DW_AT_decl_file   : (data1) 10
     <9b1>   DW_AT_decl_line   : (data1) 114
     <9b2>   DW_AT_decl_column : (data1) 17
     <9b3>   DW_AT_type        : (ref4) <0x503>, ternaryfunc
     <9b7>   DW_AT_data_member_location: (data1) 40
  <2><9b8>: Abbrev Number: 12 (DW_TAG_member)
-    <9b9>   DW_AT_name        : (strp) (offset: 0x2376): nb_negative
+    <9b9>   DW_AT_name        : (strp) (offset: 0x238d): nb_negative
     <9bd>   DW_AT_decl_file   : (data1) 10
     <9be>   DW_AT_decl_line   : (data1) 115
     <9bf>   DW_AT_decl_column : (data1) 15
     <9c0>   DW_AT_type        : (ref4) <0x4b4>, unaryfunc
     <9c4>   DW_AT_data_member_location: (data1) 48
  <2><9c5>: Abbrev Number: 12 (DW_TAG_member)
-    <9c6>   DW_AT_name        : (strp) (offset: 0x4b5e): nb_positive
+    <9c6>   DW_AT_name        : (strp) (offset: 0x4b69): nb_positive
     <9ca>   DW_AT_decl_file   : (data1) 10
     <9cb>   DW_AT_decl_line   : (data1) 116
     <9cc>   DW_AT_decl_column : (data1) 15
     <9cd>   DW_AT_type        : (ref4) <0x4b4>, unaryfunc
     <9d1>   DW_AT_data_member_location: (data1) 56
  <2><9d2>: Abbrev Number: 12 (DW_TAG_member)
-    <9d3>   DW_AT_name        : (strp) (offset: 0x47bb): nb_absolute
+    <9d3>   DW_AT_name        : (strp) (offset: 0x47c6): nb_absolute
     <9d7>   DW_AT_decl_file   : (data1) 10
     <9d8>   DW_AT_decl_line   : (data1) 117
     <9d9>   DW_AT_decl_column : (data1) 15
     <9da>   DW_AT_type        : (ref4) <0x4b4>, unaryfunc
     <9de>   DW_AT_data_member_location: (data1) 64
  <2><9df>: Abbrev Number: 12 (DW_TAG_member)
     <9e0>   DW_AT_name        : (strp) (offset: 0x1904): nb_bool
     <9e4>   DW_AT_decl_file   : (data1) 10
     <9e5>   DW_AT_decl_line   : (data1) 118
     <9e6>   DW_AT_decl_column : (data1) 13
     <9e7>   DW_AT_type        : (ref4) <0x52d>, inquiry
     <9eb>   DW_AT_data_member_location: (data1) 72
  <2><9ec>: Abbrev Number: 12 (DW_TAG_member)
-    <9ed>   DW_AT_name        : (strp) (offset: 0x3478): nb_invert
+    <9ed>   DW_AT_name        : (strp) (offset: 0x3490): nb_invert
     <9f1>   DW_AT_decl_file   : (data1) 10
     <9f2>   DW_AT_decl_line   : (data1) 119
     <9f3>   DW_AT_decl_column : (data1) 15
     <9f4>   DW_AT_type        : (ref4) <0x4b4>, unaryfunc
     <9f8>   DW_AT_data_member_location: (data1) 80
  <2><9f9>: Abbrev Number: 12 (DW_TAG_member)
     <9fa>   DW_AT_name        : (strp) (offset: 0x3ee): nb_lshift
     <9fe>   DW_AT_decl_file   : (data1) 10
     <9ff>   DW_AT_decl_line   : (data1) 120
     <a00>   DW_AT_decl_column : (data1) 16
     <a01>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <a05>   DW_AT_data_member_location: (data1) 88
  <2><a06>: Abbrev Number: 12 (DW_TAG_member)
-    <a07>   DW_AT_name        : (strp) (offset: 0x44e1): nb_rshift
+    <a07>   DW_AT_name        : (strp) (offset: 0x44f9): nb_rshift
     <a0b>   DW_AT_decl_file   : (data1) 10
     <a0c>   DW_AT_decl_line   : (data1) 121
     <a0d>   DW_AT_decl_column : (data1) 16
     <a0e>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <a12>   DW_AT_data_member_location: (data1) 96
  <2><a13>: Abbrev Number: 12 (DW_TAG_member)
     <a14>   DW_AT_name        : (strp) (offset: 0xfd2): nb_and
     <a18>   DW_AT_decl_file   : (data1) 10
     <a19>   DW_AT_decl_line   : (data1) 122
     <a1a>   DW_AT_decl_column : (data1) 16
     <a1b>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <a1f>   DW_AT_data_member_location: (data1) 104
  <2><a20>: Abbrev Number: 12 (DW_TAG_member)
-    <a21>   DW_AT_name        : (strp) (offset: 0x2290): nb_xor
+    <a21>   DW_AT_name        : (strp) (offset: 0x22a7): nb_xor
     <a25>   DW_AT_decl_file   : (data1) 10
     <a26>   DW_AT_decl_line   : (data1) 123
     <a27>   DW_AT_decl_column : (data1) 16
     <a28>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <a2c>   DW_AT_data_member_location: (data1) 112
  <2><a2d>: Abbrev Number: 12 (DW_TAG_member)
-    <a2e>   DW_AT_name        : (strp) (offset: 0x321c): nb_or
+    <a2e>   DW_AT_name        : (strp) (offset: 0x3234): nb_or
     <a32>   DW_AT_decl_file   : (data1) 10
     <a33>   DW_AT_decl_line   : (data1) 124
     <a34>   DW_AT_decl_column : (data1) 16
     <a35>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <a39>   DW_AT_data_member_location: (data1) 120
  <2><a3a>: Abbrev Number: 12 (DW_TAG_member)
-    <a3b>   DW_AT_name        : (strp) (offset: 0x5152): nb_int
+    <a3b>   DW_AT_name        : (strp) (offset: 0x515d): nb_int
     <a3f>   DW_AT_decl_file   : (data1) 10
     <a40>   DW_AT_decl_line   : (data1) 125
     <a41>   DW_AT_decl_column : (data1) 15
     <a42>   DW_AT_type        : (ref4) <0x4b4>, unaryfunc
     <a46>   DW_AT_data_member_location: (data1) 128
  <2><a47>: Abbrev Number: 12 (DW_TAG_member)
-    <a48>   DW_AT_name        : (strp) (offset: 0x1ea2): nb_reserved
+    <a48>   DW_AT_name        : (strp) (offset: 0x1eb9): nb_reserved
     <a4c>   DW_AT_decl_file   : (data1) 10
     <a4d>   DW_AT_decl_line   : (data1) 126
     <a4e>   DW_AT_decl_column : (data1) 11
     <a4f>   DW_AT_type        : (ref4) <0x49>
     <a53>   DW_AT_data_member_location: (data1) 136
  <2><a54>: Abbrev Number: 12 (DW_TAG_member)
-    <a55>   DW_AT_name        : (strp) (offset: 0x3338): nb_float
+    <a55>   DW_AT_name        : (strp) (offset: 0x3350): nb_float
     <a59>   DW_AT_decl_file   : (data1) 10
     <a5a>   DW_AT_decl_line   : (data1) 127
     <a5b>   DW_AT_decl_column : (data1) 15
     <a5c>   DW_AT_type        : (ref4) <0x4b4>, unaryfunc
     <a60>   DW_AT_data_member_location: (data1) 144
  <2><a61>: Abbrev Number: 12 (DW_TAG_member)
-    <a62>   DW_AT_name        : (strp) (offset: 0x1e7d): nb_inplace_add
+    <a62>   DW_AT_name        : (strp) (offset: 0x1e94): nb_inplace_add
     <a66>   DW_AT_decl_file   : (data1) 10
     <a67>   DW_AT_decl_line   : (data1) 129
     <a68>   DW_AT_decl_column : (data1) 16
     <a69>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <a6d>   DW_AT_data_member_location: (data1) 152
  <2><a6e>: Abbrev Number: 12 (DW_TAG_member)
-    <a6f>   DW_AT_name        : (strp) (offset: 0x52ab): nb_inplace_subtract
+    <a6f>   DW_AT_name        : (strp) (offset: 0x52b6): nb_inplace_subtract
     <a73>   DW_AT_decl_file   : (data1) 10
     <a74>   DW_AT_decl_line   : (data1) 130
     <a75>   DW_AT_decl_column : (data1) 16
     <a76>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <a7a>   DW_AT_data_member_location: (data1) 160
  <2><a7b>: Abbrev Number: 12 (DW_TAG_member)
-    <a7c>   DW_AT_name        : (strp) (offset: 0x461b): nb_inplace_multiply
+    <a7c>   DW_AT_name        : (strp) (offset: 0x4633): nb_inplace_multiply
     <a80>   DW_AT_decl_file   : (data1) 10
     <a81>   DW_AT_decl_line   : (data1) 131
     <a82>   DW_AT_decl_column : (data1) 16
     <a83>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <a87>   DW_AT_data_member_location: (data1) 168
  <2><a88>: Abbrev Number: 12 (DW_TAG_member)
-    <a89>   DW_AT_name        : (strp) (offset: 0x4679): nb_inplace_remainder
+    <a89>   DW_AT_name        : (strp) (offset: 0x4691): nb_inplace_remainder
     <a8d>   DW_AT_decl_file   : (data1) 10
     <a8e>   DW_AT_decl_line   : (data1) 132
     <a8f>   DW_AT_decl_column : (data1) 16
     <a90>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <a94>   DW_AT_data_member_location: (data1) 176
  <2><a95>: Abbrev Number: 12 (DW_TAG_member)
-    <a96>   DW_AT_name        : (strp) (offset: 0x4117): nb_inplace_power
+    <a96>   DW_AT_name        : (strp) (offset: 0x412f): nb_inplace_power
     <a9a>   DW_AT_decl_file   : (data1) 10
     <a9b>   DW_AT_decl_line   : (data1) 133
     <a9c>   DW_AT_decl_column : (data1) 17
     <a9d>   DW_AT_type        : (ref4) <0x503>, ternaryfunc
     <aa1>   DW_AT_data_member_location: (data1) 184
  <2><aa2>: Abbrev Number: 12 (DW_TAG_member)
     <aa3>   DW_AT_name        : (strp) (offset: 0x988): nb_inplace_lshift
     <aa7>   DW_AT_decl_file   : (data1) 10
     <aa8>   DW_AT_decl_line   : (data1) 134
     <aa9>   DW_AT_decl_column : (data1) 16
     <aaa>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <aae>   DW_AT_data_member_location: (data1) 192
  <2><aaf>: Abbrev Number: 12 (DW_TAG_member)
-    <ab0>   DW_AT_name        : (strp) (offset: 0x4abe): nb_inplace_rshift
+    <ab0>   DW_AT_name        : (strp) (offset: 0x4ac9): nb_inplace_rshift
     <ab4>   DW_AT_decl_file   : (data1) 10
     <ab5>   DW_AT_decl_line   : (data1) 135
     <ab6>   DW_AT_decl_column : (data1) 16
     <ab7>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <abb>   DW_AT_data_member_location: (data1) 200
  <2><abc>: Abbrev Number: 12 (DW_TAG_member)
-    <abd>   DW_AT_name        : (strp) (offset: 0x2bb4): nb_inplace_and
+    <abd>   DW_AT_name        : (strp) (offset: 0x2bba): nb_inplace_and
     <ac1>   DW_AT_decl_file   : (data1) 10
     <ac2>   DW_AT_decl_line   : (data1) 136
     <ac3>   DW_AT_decl_column : (data1) 16
     <ac4>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <ac8>   DW_AT_data_member_location: (data1) 208
  <2><ac9>: Abbrev Number: 12 (DW_TAG_member)
-    <aca>   DW_AT_name        : (strp) (offset: 0x40df): nb_inplace_xor
+    <aca>   DW_AT_name        : (strp) (offset: 0x40f7): nb_inplace_xor
     <ace>   DW_AT_decl_file   : (data1) 10
     <acf>   DW_AT_decl_line   : (data1) 137
     <ad0>   DW_AT_decl_column : (data1) 16
     <ad1>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <ad5>   DW_AT_data_member_location: (data1) 216
  <2><ad6>: Abbrev Number: 12 (DW_TAG_member)
-    <ad7>   DW_AT_name        : (strp) (offset: 0x494e): nb_inplace_or
+    <ad7>   DW_AT_name        : (strp) (offset: 0x4959): nb_inplace_or
     <adb>   DW_AT_decl_file   : (data1) 10
     <adc>   DW_AT_decl_line   : (data1) 138
     <add>   DW_AT_decl_column : (data1) 16
     <ade>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <ae2>   DW_AT_data_member_location: (data1) 224
  <2><ae3>: Abbrev Number: 12 (DW_TAG_member)
     <ae4>   DW_AT_name        : (strp) (offset: 0x920): nb_floor_divide
     <ae8>   DW_AT_decl_file   : (data1) 10
     <ae9>   DW_AT_decl_line   : (data1) 140
     <aea>   DW_AT_decl_column : (data1) 16
     <aeb>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <aef>   DW_AT_data_member_location: (data1) 232
  <2><af0>: Abbrev Number: 12 (DW_TAG_member)
-    <af1>   DW_AT_name        : (strp) (offset: 0x423a): nb_true_divide
+    <af1>   DW_AT_name        : (strp) (offset: 0x4252): nb_true_divide
     <af5>   DW_AT_decl_file   : (data1) 10
     <af6>   DW_AT_decl_line   : (data1) 141
     <af7>   DW_AT_decl_column : (data1) 16
     <af8>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <afc>   DW_AT_data_member_location: (data1) 240
  <2><afd>: Abbrev Number: 12 (DW_TAG_member)
-    <afe>   DW_AT_name        : (strp) (offset: 0x43c9): nb_inplace_floor_divide
+    <afe>   DW_AT_name        : (strp) (offset: 0x43e1): nb_inplace_floor_divide
     <b02>   DW_AT_decl_file   : (data1) 10
     <b03>   DW_AT_decl_line   : (data1) 142
     <b04>   DW_AT_decl_column : (data1) 16
     <b05>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <b09>   DW_AT_data_member_location: (data1) 248
  <2><b0a>: Abbrev Number: 61 (DW_TAG_member)
-    <b0b>   DW_AT_name        : (strp) (offset: 0x281a): nb_inplace_true_divide
+    <b0b>   DW_AT_name        : (strp) (offset: 0x2831): nb_inplace_true_divide
     <b0f>   DW_AT_decl_file   : (data1) 10
     <b10>   DW_AT_decl_line   : (data1) 143
     <b11>   DW_AT_decl_column : (data1) 16
     <b12>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <b16>   DW_AT_data_member_location: (data2) 256
  <2><b18>: Abbrev Number: 61 (DW_TAG_member)
     <b19>   DW_AT_name        : (strp) (offset: 0xbb5): nb_index
@@ -1465,15 +1465,15 @@
     <b27>   DW_AT_name        : (strp) (offset: 0x3c8): nb_matrix_multiply
     <b2b>   DW_AT_decl_file   : (data1) 10
     <b2c>   DW_AT_decl_line   : (data1) 147
     <b2d>   DW_AT_decl_column : (data1) 16
     <b2e>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <b32>   DW_AT_data_member_location: (data2) 272
  <2><b34>: Abbrev Number: 61 (DW_TAG_member)
-    <b35>   DW_AT_name        : (strp) (offset: 0x5283): nb_inplace_matrix_multiply
+    <b35>   DW_AT_name        : (strp) (offset: 0x528e): nb_inplace_matrix_multiply
     <b39>   DW_AT_decl_file   : (data1) 10
     <b3a>   DW_AT_decl_line   : (data1) 148
     <b3b>   DW_AT_decl_column : (data1) 16
     <b3c>   DW_AT_type        : (ref4) <0x4de>, binaryfunc
     <b40>   DW_AT_data_member_location: (data2) 280
  <2><b42>: Abbrev Number: 0
  <1><b43>: Abbrev Number: 22 (DW_TAG_typedef)
@@ -1485,15 +1485,15 @@
  <1><b4f>: Abbrev Number: 54 (DW_TAG_structure_type)
     <b50>   DW_AT_byte_size   : (data1) 80
     <b51>   DW_AT_decl_file   : (data1) 10
     <b52>   DW_AT_decl_line   : (data1) 151
     <b53>   DW_AT_decl_column : (data1) 9
     <b54>   DW_AT_sibling     : (ref4) <0xbdb>
  <2><b58>: Abbrev Number: 12 (DW_TAG_member)
-    <b59>   DW_AT_name        : (strp) (offset: 0x42e4): sq_length
+    <b59>   DW_AT_name        : (strp) (offset: 0x42fc): sq_length
     <b5d>   DW_AT_decl_file   : (data1) 10
     <b5e>   DW_AT_decl_line   : (data1) 152
     <b5f>   DW_AT_decl_column : (data1) 13
     <b60>   DW_AT_type        : (ref4) <0x54d>, lenfunc
     <b64>   DW_AT_data_member_location: (data1) 0
  <2><b65>: Abbrev Number: 12 (DW_TAG_member)
     <b66>   DW_AT_name        : (strp) (offset: 0x619): sq_concat
@@ -1556,27 +1556,27 @@
     <bd2>   DW_AT_decl_file   : (data1) 10
     <bd3>   DW_AT_decl_line   : (data1) 162
     <bd4>   DW_AT_decl_column : (data1) 18
     <bd5>   DW_AT_type        : (ref4) <0x56d>, ssizeargfunc
     <bd9>   DW_AT_data_member_location: (data1) 72
  <2><bda>: Abbrev Number: 0
  <1><bdb>: Abbrev Number: 22 (DW_TAG_typedef)
-    <bdc>   DW_AT_name        : (strp) (offset: 0x2f36): PySequenceMethods
+    <bdc>   DW_AT_name        : (strp) (offset: 0x2f3c): PySequenceMethods
     <be0>   DW_AT_decl_file   : (data1) 10
     <be1>   DW_AT_decl_line   : (data1) 163
     <be2>   DW_AT_decl_column : (data1) 3
     <be3>   DW_AT_type        : (ref4) <0xb4f>
  <1><be7>: Abbrev Number: 54 (DW_TAG_structure_type)
     <be8>   DW_AT_byte_size   : (data1) 24
     <be9>   DW_AT_decl_file   : (data1) 10
     <bea>   DW_AT_decl_line   : (data1) 165
     <beb>   DW_AT_decl_column : (data1) 9
     <bec>   DW_AT_sibling     : (ref4) <0xc18>
  <2><bf0>: Abbrev Number: 12 (DW_TAG_member)
-    <bf1>   DW_AT_name        : (strp) (offset: 0x400c): mp_length
+    <bf1>   DW_AT_name        : (strp) (offset: 0x4024): mp_length
     <bf5>   DW_AT_decl_file   : (data1) 10
     <bf6>   DW_AT_decl_line   : (data1) 166
     <bf7>   DW_AT_decl_column : (data1) 13
     <bf8>   DW_AT_type        : (ref4) <0x54d>, lenfunc
     <bfc>   DW_AT_data_member_location: (data1) 0
  <2><bfd>: Abbrev Number: 12 (DW_TAG_member)
     <bfe>   DW_AT_name        : (strp) (offset: 0x1719): mp_subscript
@@ -1590,21 +1590,21 @@
     <c0f>   DW_AT_decl_file   : (data1) 10
     <c10>   DW_AT_decl_line   : (data1) 168
     <c11>   DW_AT_decl_column : (data1) 19
     <c12>   DW_AT_type        : (ref4) <0x5bc>, objobjargproc
     <c16>   DW_AT_data_member_location: (data1) 16
  <2><c17>: Abbrev Number: 0
  <1><c18>: Abbrev Number: 22 (DW_TAG_typedef)
-    <c19>   DW_AT_name        : (strp) (offset: 0x4bb4): PyMappingMethods
+    <c19>   DW_AT_name        : (strp) (offset: 0x4bbf): PyMappingMethods
     <c1d>   DW_AT_decl_file   : (data1) 10
     <c1e>   DW_AT_decl_line   : (data1) 169
     <c1f>   DW_AT_decl_column : (data1) 3
     <c20>   DW_AT_type        : (ref4) <0xbe7>
  <1><c24>: Abbrev Number: 22 (DW_TAG_typedef)
-    <c25>   DW_AT_name        : (strp) (offset: 0x3f6e): sendfunc
+    <c25>   DW_AT_name        : (strp) (offset: 0x3f86): sendfunc
     <c29>   DW_AT_decl_file   : (data1) 10
     <c2a>   DW_AT_decl_line   : (data1) 171
     <c2b>   DW_AT_decl_column : (data1) 24
     <c2c>   DW_AT_type        : (ref4) <0xc30>
  <1><c30>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <c31>   DW_AT_byte_size   : (implicit_const) 8
     <c31>   DW_AT_type        : (ref4) <0xc35>, PySendResult, int
@@ -1625,71 +1625,71 @@
  <1><c53>: Abbrev Number: 54 (DW_TAG_structure_type)
     <c54>   DW_AT_byte_size   : (data1) 32
     <c55>   DW_AT_decl_file   : (data1) 10
     <c56>   DW_AT_decl_line   : (data1) 173
     <c57>   DW_AT_decl_column : (data1) 9
     <c58>   DW_AT_sibling     : (ref4) <0xc91>
  <2><c5c>: Abbrev Number: 12 (DW_TAG_member)
-    <c5d>   DW_AT_name        : (strp) (offset: 0x3f28): am_await
+    <c5d>   DW_AT_name        : (strp) (offset: 0x3f40): am_await
     <c61>   DW_AT_decl_file   : (data1) 10
     <c62>   DW_AT_decl_line   : (data1) 174
     <c63>   DW_AT_decl_column : (data1) 15
     <c64>   DW_AT_type        : (ref4) <0x4b4>, unaryfunc
     <c68>   DW_AT_data_member_location: (data1) 0
  <2><c69>: Abbrev Number: 12 (DW_TAG_member)
-    <c6a>   DW_AT_name        : (strp) (offset: 0x40b2): am_aiter
+    <c6a>   DW_AT_name        : (strp) (offset: 0x40ca): am_aiter
     <c6e>   DW_AT_decl_file   : (data1) 10
     <c6f>   DW_AT_decl_line   : (data1) 175
     <c70>   DW_AT_decl_column : (data1) 15
     <c71>   DW_AT_type        : (ref4) <0x4b4>, unaryfunc
     <c75>   DW_AT_data_member_location: (data1) 8
  <2><c76>: Abbrev Number: 12 (DW_TAG_member)
     <c77>   DW_AT_name        : (strp) (offset: 0x4e9): am_anext
     <c7b>   DW_AT_decl_file   : (data1) 10
     <c7c>   DW_AT_decl_line   : (data1) 176
     <c7d>   DW_AT_decl_column : (data1) 15
     <c7e>   DW_AT_type        : (ref4) <0x4b4>, unaryfunc
     <c82>   DW_AT_data_member_location: (data1) 16
  <2><c83>: Abbrev Number: 12 (DW_TAG_member)
-    <c84>   DW_AT_name        : (strp) (offset: 0x24c7): am_send
+    <c84>   DW_AT_name        : (strp) (offset: 0x24de): am_send
     <c88>   DW_AT_decl_file   : (data1) 10
     <c89>   DW_AT_decl_line   : (data1) 177
     <c8a>   DW_AT_decl_column : (data1) 14
     <c8b>   DW_AT_type        : (ref4) <0xc24>, sendfunc
     <c8f>   DW_AT_data_member_location: (data1) 24
  <2><c90>: Abbrev Number: 0
  <1><c91>: Abbrev Number: 22 (DW_TAG_typedef)
-    <c92>   DW_AT_name        : (strp) (offset: 0x369d): PyAsyncMethods
+    <c92>   DW_AT_name        : (strp) (offset: 0x36b5): PyAsyncMethods
     <c96>   DW_AT_decl_file   : (data1) 10
     <c97>   DW_AT_decl_line   : (data1) 178
     <c98>   DW_AT_decl_column : (data1) 3
     <c99>   DW_AT_type        : (ref4) <0xc53>
  <1><c9d>: Abbrev Number: 54 (DW_TAG_structure_type)
     <c9e>   DW_AT_byte_size   : (data1) 16
     <c9f>   DW_AT_decl_file   : (data1) 10
     <ca0>   DW_AT_decl_line   : (data1) 180
     <ca1>   DW_AT_decl_column : (data1) 9
     <ca2>   DW_AT_sibling     : (ref4) <0xcc1>
  <2><ca6>: Abbrev Number: 12 (DW_TAG_member)
-    <ca7>   DW_AT_name        : (strp) (offset: 0x1cd5): bf_getbuffer
+    <ca7>   DW_AT_name        : (strp) (offset: 0x1cda): bf_getbuffer
     <cab>   DW_AT_decl_file   : (data1) 10
     <cac>   DW_AT_decl_line   : (data1) 181
     <cad>   DW_AT_decl_column : (data1) 20
     <cae>   DW_AT_type        : (ref4) <0x8dc>, getbufferproc
     <cb2>   DW_AT_data_member_location: (data1) 0
  <2><cb3>: Abbrev Number: 12 (DW_TAG_member)
-    <cb4>   DW_AT_name        : (strp) (offset: 0x45b8): bf_releasebuffer
+    <cb4>   DW_AT_name        : (strp) (offset: 0x45d0): bf_releasebuffer
     <cb8>   DW_AT_decl_file   : (data1) 10
     <cb9>   DW_AT_decl_line   : (data1) 182
     <cba>   DW_AT_decl_column : (data1) 24
     <cbb>   DW_AT_type        : (ref4) <0x90b>, releasebufferproc
     <cbf>   DW_AT_data_member_location: (data1) 8
  <2><cc0>: Abbrev Number: 0
  <1><cc1>: Abbrev Number: 22 (DW_TAG_typedef)
-    <cc2>   DW_AT_name        : (strp) (offset: 0x270e): PyBufferProcs
+    <cc2>   DW_AT_name        : (strp) (offset: 0x2725): PyBufferProcs
     <cc6>   DW_AT_decl_file   : (data1) 10
     <cc7>   DW_AT_decl_line   : (data1) 183
     <cc8>   DW_AT_decl_column : (data1) 3
     <cc9>   DW_AT_type        : (ref4) <0xc9d>
  <1><ccd>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <cce>   DW_AT_byte_size   : (implicit_const) 8
     <cce>   DW_AT_type        : (ref4) <0xc91>, PyAsyncMethods
@@ -1709,36 +1709,36 @@
     <ce7>   DW_AT_name        : (strp) (offset: 0x166b): PyMethodDef
     <ceb>   DW_AT_byte_size   : (data1) 32
     <cec>   DW_AT_decl_file   : (data1) 11
     <ced>   DW_AT_decl_line   : (data1) 35
     <cee>   DW_AT_decl_column : (data1) 8
     <cef>   DW_AT_sibling     : (ref4) <0xd28>
  <2><cf3>: Abbrev Number: 12 (DW_TAG_member)
-    <cf4>   DW_AT_name        : (strp) (offset: 0x3536): ml_name
+    <cf4>   DW_AT_name        : (strp) (offset: 0x354e): ml_name
     <cf8>   DW_AT_decl_file   : (data1) 11
     <cf9>   DW_AT_decl_line   : (data1) 36
     <cfa>   DW_AT_decl_column : (data1) 18
     <cfb>   DW_AT_type        : (ref4) <0xdf>
     <cff>   DW_AT_data_member_location: (data1) 0
  <2><d00>: Abbrev Number: 12 (DW_TAG_member)
-    <d01>   DW_AT_name        : (strp) (offset: 0x3787): ml_meth
+    <d01>   DW_AT_name        : (strp) (offset: 0x379f): ml_meth
     <d05>   DW_AT_decl_file   : (data1) 11
     <d06>   DW_AT_decl_line   : (data1) 37
     <d07>   DW_AT_decl_column : (data1) 17
     <d08>   DW_AT_type        : (ref4) <0x1134>, PyCFunction
     <d0c>   DW_AT_data_member_location: (data1) 8
  <2><d0d>: Abbrev Number: 12 (DW_TAG_member)
-    <d0e>   DW_AT_name        : (strp) (offset: 0x2767): ml_flags
+    <d0e>   DW_AT_name        : (strp) (offset: 0x277e): ml_flags
     <d12>   DW_AT_decl_file   : (data1) 11
     <d13>   DW_AT_decl_line   : (data1) 38
     <d14>   DW_AT_decl_column : (data1) 17
     <d15>   DW_AT_type        : (ref4) <0x90>, int
     <d19>   DW_AT_data_member_location: (data1) 16
  <2><d1a>: Abbrev Number: 12 (DW_TAG_member)
-    <d1b>   DW_AT_name        : (strp) (offset: 0x34cd): ml_doc
+    <d1b>   DW_AT_name        : (strp) (offset: 0x34e5): ml_doc
     <d1f>   DW_AT_decl_file   : (data1) 11
     <d20>   DW_AT_decl_line   : (data1) 40
     <d21>   DW_AT_decl_column : (data1) 18
     <d22>   DW_AT_type        : (ref4) <0xdf>
     <d26>   DW_AT_data_member_location: (data1) 24
  <2><d27>: Abbrev Number: 0
  <1><d28>: Abbrev Number: 27 (DW_TAG_pointer_type)
@@ -1748,36 +1748,36 @@
     <d2e>   DW_AT_name        : (strp) (offset: 0xde2): PyMemberDef
     <d32>   DW_AT_byte_size   : (data1) 40
     <d33>   DW_AT_decl_file   : (data1) 12
     <d34>   DW_AT_decl_line   : (data1) 18
     <d35>   DW_AT_decl_column : (data1) 16
     <d36>   DW_AT_sibling     : (ref4) <0xd7c>
  <2><d3a>: Abbrev Number: 12 (DW_TAG_member)
-    <d3b>   DW_AT_name        : (strp) (offset: 0x3e08): name
+    <d3b>   DW_AT_name        : (strp) (offset: 0x3e20): name
     <d3f>   DW_AT_decl_file   : (data1) 12
     <d40>   DW_AT_decl_line   : (data1) 19
     <d41>   DW_AT_decl_column : (data1) 17
     <d42>   DW_AT_type        : (ref4) <0xdf>
     <d46>   DW_AT_data_member_location: (data1) 0
  <2><d47>: Abbrev Number: 12 (DW_TAG_member)
     <d48>   DW_AT_name        : (strp) (offset: 0xe0e): type
     <d4c>   DW_AT_decl_file   : (data1) 12
     <d4d>   DW_AT_decl_line   : (data1) 20
     <d4e>   DW_AT_decl_column : (data1) 9
     <d4f>   DW_AT_type        : (ref4) <0x90>, int
     <d53>   DW_AT_data_member_location: (data1) 8
  <2><d54>: Abbrev Number: 12 (DW_TAG_member)
-    <d55>   DW_AT_name        : (strp) (offset: 0x3419): offset
+    <d55>   DW_AT_name        : (strp) (offset: 0x3431): offset
     <d59>   DW_AT_decl_file   : (data1) 12
     <d5a>   DW_AT_decl_line   : (data1) 21
     <d5b>   DW_AT_decl_column : (data1) 16
     <d5c>   DW_AT_type        : (ref4) <0x15e>, Py_ssize_t, ssize_t, __ssize_t, long int
     <d60>   DW_AT_data_member_location: (data1) 16
  <2><d61>: Abbrev Number: 12 (DW_TAG_member)
-    <d62>   DW_AT_name        : (strp) (offset: 0x276a): flags
+    <d62>   DW_AT_name        : (strp) (offset: 0x2781): flags
     <d66>   DW_AT_decl_file   : (data1) 12
     <d67>   DW_AT_decl_line   : (data1) 22
     <d68>   DW_AT_decl_column : (data1) 9
     <d69>   DW_AT_type        : (ref4) <0x90>, int
     <d6d>   DW_AT_data_member_location: (data1) 24
  <2><d6e>: Abbrev Number: 70 (DW_TAG_member)
     <d6f>   DW_AT_name        : (string) doc
@@ -1794,15 +1794,15 @@
     <d82>   DW_AT_name        : (strp) (offset: 0x6ce): PyGetSetDef
     <d86>   DW_AT_byte_size   : (data1) 40
     <d87>   DW_AT_decl_file   : (data1) 13
     <d88>   DW_AT_decl_line   : (data1) 11
     <d89>   DW_AT_decl_column : (data1) 16
     <d8a>   DW_AT_sibling     : (ref4) <0xdd0>
  <2><d8e>: Abbrev Number: 12 (DW_TAG_member)
-    <d8f>   DW_AT_name        : (strp) (offset: 0x3e08): name
+    <d8f>   DW_AT_name        : (strp) (offset: 0x3e20): name
     <d93>   DW_AT_decl_file   : (data1) 13
     <d94>   DW_AT_decl_line   : (data1) 12
     <d95>   DW_AT_decl_column : (data1) 17
     <d96>   DW_AT_type        : (ref4) <0xdf>
     <d9a>   DW_AT_data_member_location: (data1) 0
  <2><d9b>: Abbrev Number: 70 (DW_TAG_member)
     <d9c>   DW_AT_name        : (string) get
@@ -1822,15 +1822,15 @@
     <db6>   DW_AT_name        : (string) doc
     <dba>   DW_AT_decl_file   : (data1) 13
     <dbb>   DW_AT_decl_line   : (data1) 15
     <dbc>   DW_AT_decl_column : (data1) 17
     <dbd>   DW_AT_type        : (ref4) <0xdf>
     <dc1>   DW_AT_data_member_location: (data1) 24
  <2><dc2>: Abbrev Number: 12 (DW_TAG_member)
-    <dc3>   DW_AT_name        : (strp) (offset: 0x360b): closure
+    <dc3>   DW_AT_name        : (strp) (offset: 0x3623): closure
     <dc7>   DW_AT_decl_file   : (data1) 13
     <dc8>   DW_AT_decl_line   : (data1) 16
     <dc9>   DW_AT_decl_column : (data1) 11
     <dca>   DW_AT_type        : (ref4) <0x49>
     <dce>   DW_AT_data_member_location: (data1) 32
  <2><dcf>: Abbrev Number: 0
  <1><dd0>: Abbrev Number: 27 (DW_TAG_pointer_type)
@@ -1839,63 +1839,63 @@
  <1><dd5>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <dd6>   DW_AT_byte_size   : (implicit_const) 8
     <dd6>   DW_AT_type        : (ref4) <0x19a>, _typeobject
  <1><dda>: Abbrev Number: 93 (DW_TAG_structure_type)
     <ddb>   DW_AT_name        : (strp) (offset: 0x1ab): _dictkeysobject
     <ddf>   DW_AT_declaration : (flag_present) 1
  <1><ddf>: Abbrev Number: 22 (DW_TAG_typedef)
-    <de0>   DW_AT_name        : (strp) (offset: 0x3f39): Py_UCS4
+    <de0>   DW_AT_name        : (strp) (offset: 0x3f51): Py_UCS4
     <de4>   DW_AT_decl_file   : (data1) 14
     <de5>   DW_AT_decl_line   : (data1) 102
     <de6>   DW_AT_decl_column : (data1) 18
     <de7>   DW_AT_type        : (ref4) <0x146>, uint32_t, __uint32_t, unsigned int
  <1><deb>: Abbrev Number: 22 (DW_TAG_typedef)
-    <dec>   DW_AT_name        : (strp) (offset: 0x3f31): Py_UCS2
+    <dec>   DW_AT_name        : (strp) (offset: 0x3f49): Py_UCS2
     <df0>   DW_AT_decl_file   : (data1) 14
     <df1>   DW_AT_decl_line   : (data1) 103
     <df2>   DW_AT_decl_column : (data1) 18
     <df3>   DW_AT_type        : (ref4) <0x13a>, uint16_t, __uint16_t, short unsigned int
  <1><df7>: Abbrev Number: 22 (DW_TAG_typedef)
-    <df8>   DW_AT_name        : (strp) (offset: 0x2062): Py_UCS1
+    <df8>   DW_AT_name        : (strp) (offset: 0x2079): Py_UCS1
     <dfc>   DW_AT_decl_file   : (data1) 14
     <dfd>   DW_AT_decl_line   : (data1) 104
     <dfe>   DW_AT_decl_column : (data1) 17
     <dff>   DW_AT_type        : (ref4) <0x12e>, uint8_t, __uint8_t, unsigned char
  <1><e03>: Abbrev Number: 48 (DW_TAG_variable)
-    <e04>   DW_AT_name        : (strp) (offset: 0x1f6c): PyUnicode_Type
+    <e04>   DW_AT_name        : (strp) (offset: 0x1f83): PyUnicode_Type
     <e08>   DW_AT_decl_file   : (data1) 14
     <e09>   DW_AT_decl_line   : (data1) 111
     <e0a>   DW_AT_decl_column : (data1) 26
     <e0b>   DW_AT_type        : (ref4) <0x189>, PyTypeObject, _typeobject
     <e0f>   DW_AT_external    : (flag_present) 1
     <e0f>   DW_AT_declaration : (flag_present) 1
  <1><e0f>: Abbrev Number: 54 (DW_TAG_structure_type)
     <e10>   DW_AT_byte_size   : (data1) 4
     <e11>   DW_AT_decl_file   : (data1) 15
     <e12>   DW_AT_decl_line   : (data1) 162
     <e13>   DW_AT_decl_column : (data1) 5
     <e14>   DW_AT_sibling     : (ref4) <0xe55>
  <2><e18>: Abbrev Number: 75 (DW_TAG_member)
-    <e19>   DW_AT_name        : (strp) (offset: 0x4e56): interned
+    <e19>   DW_AT_name        : (strp) (offset: 0x4e61): interned
     <e1d>   DW_AT_decl_file   : (implicit_const) 15
     <e1d>   DW_AT_decl_line   : (data1) 171
     <e1e>   DW_AT_decl_column : (implicit_const) 22
     <e1e>   DW_AT_type        : (ref4) <0x42>, unsigned int
     <e22>   DW_AT_bit_size    : (data1) 2
     <e23>   DW_AT_data_bit_offset: (data1) 0
  <2><e24>: Abbrev Number: 75 (DW_TAG_member)
-    <e25>   DW_AT_name        : (strp) (offset: 0x4650): kind
+    <e25>   DW_AT_name        : (strp) (offset: 0x4668): kind
     <e29>   DW_AT_decl_file   : (implicit_const) 15
     <e29>   DW_AT_decl_line   : (data1) 199
     <e2a>   DW_AT_decl_column : (implicit_const) 22
     <e2a>   DW_AT_type        : (ref4) <0x42>, unsigned int
     <e2e>   DW_AT_bit_size    : (data1) 3
     <e2f>   DW_AT_data_bit_offset: (data1) 2
  <2><e30>: Abbrev Number: 75 (DW_TAG_member)
-    <e31>   DW_AT_name        : (strp) (offset: 0x2e2d): compact
+    <e31>   DW_AT_name        : (strp) (offset: 0x2e33): compact
     <e35>   DW_AT_decl_file   : (implicit_const) 15
     <e35>   DW_AT_decl_line   : (data1) 204
     <e36>   DW_AT_decl_column : (implicit_const) 22
     <e36>   DW_AT_type        : (ref4) <0x42>, unsigned int
     <e3a>   DW_AT_bit_size    : (data1) 1
     <e3b>   DW_AT_data_bit_offset: (data1) 5
  <2><e3c>: Abbrev Number: 75 (DW_TAG_member)
@@ -1903,15 +1903,15 @@
     <e41>   DW_AT_decl_file   : (implicit_const) 15
     <e41>   DW_AT_decl_line   : (data1) 208
     <e42>   DW_AT_decl_column : (implicit_const) 22
     <e42>   DW_AT_type        : (ref4) <0x42>, unsigned int
     <e46>   DW_AT_bit_size    : (data1) 1
     <e47>   DW_AT_data_bit_offset: (data1) 6
  <2><e48>: Abbrev Number: 75 (DW_TAG_member)
-    <e49>   DW_AT_name        : (strp) (offset: 0x4016): ready
+    <e49>   DW_AT_name        : (strp) (offset: 0x402e): ready
     <e4d>   DW_AT_decl_file   : (implicit_const) 15
     <e4d>   DW_AT_decl_line   : (data1) 213
     <e4e>   DW_AT_decl_column : (implicit_const) 22
     <e4e>   DW_AT_type        : (ref4) <0x42>, unsigned int
     <e52>   DW_AT_bit_size    : (data1) 1
     <e53>   DW_AT_data_bit_offset: (data1) 7
  <2><e54>: Abbrev Number: 0
@@ -1932,22 +1932,22 @@
     <e6c>   DW_AT_name        : (strp) (offset: 0xec0): length
     <e70>   DW_AT_decl_file   : (data1) 15
     <e71>   DW_AT_decl_line   : (data1) 160
     <e72>   DW_AT_decl_column : (data1) 16
     <e73>   DW_AT_type        : (ref4) <0x15e>, Py_ssize_t, ssize_t, __ssize_t, long int
     <e77>   DW_AT_data_member_location: (data1) 16
  <2><e78>: Abbrev Number: 12 (DW_TAG_member)
-    <e79>   DW_AT_name        : (strp) (offset: 0x3c7f): hash
+    <e79>   DW_AT_name        : (strp) (offset: 0x3c97): hash
     <e7d>   DW_AT_decl_file   : (data1) 15
     <e7e>   DW_AT_decl_line   : (data1) 161
     <e7f>   DW_AT_decl_column : (data1) 15
     <e80>   DW_AT_type        : (ref4) <0x16f>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
     <e84>   DW_AT_data_member_location: (data1) 24
  <2><e85>: Abbrev Number: 12 (DW_TAG_member)
-    <e86>   DW_AT_name        : (strp) (offset: 0x1d49): state
+    <e86>   DW_AT_name        : (strp) (offset: 0x1d4e): state
     <e8a>   DW_AT_decl_file   : (data1) 15
     <e8b>   DW_AT_decl_line   : (data1) 217
     <e8c>   DW_AT_decl_column : (data1) 7
     <e8d>   DW_AT_type        : (ref4) <0xe0f>
     <e91>   DW_AT_data_member_location: (data1) 32
  <2><e92>: Abbrev Number: 12 (DW_TAG_member)
     <e93>   DW_AT_name        : (strp) (offset: 0xbcd): wstr
@@ -1957,15 +1957,15 @@
     <e9a>   DW_AT_type        : (ref4) <0xea0>
     <e9e>   DW_AT_data_member_location: (data1) 40
  <2><e9f>: Abbrev Number: 0
  <1><ea0>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <ea1>   DW_AT_byte_size   : (implicit_const) 8
     <ea1>   DW_AT_type        : (ref4) <0xf0>, wchar_t, int
  <1><ea5>: Abbrev Number: 22 (DW_TAG_typedef)
-    <ea6>   DW_AT_name        : (strp) (offset: 0x4581): PyASCIIObject
+    <ea6>   DW_AT_name        : (strp) (offset: 0x4599): PyASCIIObject
     <eaa>   DW_AT_decl_file   : (data1) 15
     <eab>   DW_AT_decl_line   : (data1) 219
     <eac>   DW_AT_decl_column : (data1) 3
     <ead>   DW_AT_type        : (ref4) <0xe55>
  <1><eb1>: Abbrev Number: 54 (DW_TAG_structure_type)
     <eb2>   DW_AT_byte_size   : (data1) 72
     <eb3>   DW_AT_decl_file   : (data1) 15
@@ -1990,15 +1990,15 @@
     <ed5>   DW_AT_name        : (strp) (offset: 0x253): utf8
     <ed9>   DW_AT_decl_file   : (data1) 15
     <eda>   DW_AT_decl_line   : (data1) 228
     <edb>   DW_AT_decl_column : (data1) 11
     <edc>   DW_AT_type        : (ref4) <0xce>
     <ee0>   DW_AT_data_member_location: (data1) 56
  <2><ee1>: Abbrev Number: 12 (DW_TAG_member)
-    <ee2>   DW_AT_name        : (strp) (offset: 0x3c07): wstr_length
+    <ee2>   DW_AT_name        : (strp) (offset: 0x3c1f): wstr_length
     <ee6>   DW_AT_decl_file   : (data1) 15
     <ee7>   DW_AT_decl_line   : (data1) 229
     <ee8>   DW_AT_decl_column : (data1) 16
     <ee9>   DW_AT_type        : (ref4) <0x15e>, Py_ssize_t, ssize_t, __ssize_t, long int
     <eed>   DW_AT_data_member_location: (data1) 64
  <2><eee>: Abbrev Number: 0
  <1><eef>: Abbrev Number: 22 (DW_TAG_typedef)
@@ -2016,27 +2016,27 @@
  <2><f04>: Abbrev Number: 108 (DW_TAG_member)
     <f05>   DW_AT_name        : (string) any
     <f09>   DW_AT_decl_file   : (data1) 15
     <f0a>   DW_AT_decl_line   : (data1) 239
     <f0b>   DW_AT_decl_column : (data1) 15
     <f0c>   DW_AT_type        : (ref4) <0x49>
  <2><f10>: Abbrev Number: 81 (DW_TAG_member)
-    <f11>   DW_AT_name        : (strp) (offset: 0x4249): latin1
+    <f11>   DW_AT_name        : (strp) (offset: 0x4261): latin1
     <f15>   DW_AT_decl_file   : (implicit_const) 15
     <f15>   DW_AT_decl_line   : (data1) 240
     <f16>   DW_AT_decl_column : (implicit_const) 18
     <f16>   DW_AT_type        : (ref4) <0xf2f>
  <2><f1a>: Abbrev Number: 81 (DW_TAG_member)
-    <f1b>   DW_AT_name        : (strp) (offset: 0x311b): ucs2
+    <f1b>   DW_AT_name        : (strp) (offset: 0x3121): ucs2
     <f1f>   DW_AT_decl_file   : (implicit_const) 15
     <f1f>   DW_AT_decl_line   : (data1) 241
     <f20>   DW_AT_decl_column : (implicit_const) 18
     <f20>   DW_AT_type        : (ref4) <0xf34>
  <2><f24>: Abbrev Number: 81 (DW_TAG_member)
-    <f25>   DW_AT_name        : (strp) (offset: 0x3120): ucs4
+    <f25>   DW_AT_name        : (strp) (offset: 0x3126): ucs4
     <f29>   DW_AT_decl_file   : (implicit_const) 15
     <f29>   DW_AT_decl_line   : (data1) 242
     <f2a>   DW_AT_decl_column : (implicit_const) 18
     <f2a>   DW_AT_type        : (ref4) <0xf39>
  <2><f2e>: Abbrev Number: 0
  <1><f2f>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <f30>   DW_AT_byte_size   : (implicit_const) 8
@@ -2057,108 +2057,108 @@
     <f48>   DW_AT_name        : (strp) (offset: 0x1205): _base
     <f4c>   DW_AT_decl_file   : (data1) 15
     <f4d>   DW_AT_decl_line   : (data1) 237
     <f4e>   DW_AT_decl_column : (data1) 28
     <f4f>   DW_AT_type        : (ref4) <0xeef>, PyCompactUnicodeObject
     <f53>   DW_AT_data_member_location: (data1) 0
  <2><f54>: Abbrev Number: 12 (DW_TAG_member)
-    <f55>   DW_AT_name        : (strp) (offset: 0x3999): data
+    <f55>   DW_AT_name        : (strp) (offset: 0x39b1): data
     <f59>   DW_AT_decl_file   : (data1) 15
     <f5a>   DW_AT_decl_line   : (data1) 243
     <f5b>   DW_AT_decl_column : (data1) 7
     <f5c>   DW_AT_type        : (ref4) <0xefb>
     <f60>   DW_AT_data_member_location: (data1) 72
  <2><f61>: Abbrev Number: 0
  <1><f62>: Abbrev Number: 22 (DW_TAG_typedef)
-    <f63>   DW_AT_name        : (strp) (offset: 0x28fc): PyUnicodeObject
+    <f63>   DW_AT_name        : (strp) (offset: 0x2913): PyUnicodeObject
     <f67>   DW_AT_decl_file   : (data1) 15
     <f68>   DW_AT_decl_line   : (data1) 244
     <f69>   DW_AT_decl_column : (data1) 3
     <f6a>   DW_AT_type        : (ref4) <0xf3e>
  <1><f6e>: Abbrev Number: 109 (DW_TAG_enumeration_type)
-    <f6f>   DW_AT_name        : (strp) (offset: 0x4ca2): PyUnicode_Kind
+    <f6f>   DW_AT_name        : (strp) (offset: 0x4cad): PyUnicode_Kind
     <f73>   DW_AT_encoding    : (data1) 7	(unsigned)
     <f74>   DW_AT_byte_size   : (data1) 4
     <f75>   DW_AT_type        : (ref4) <0x42>, unsigned int
     <f79>   DW_AT_decl_file   : (data1) 15
     <f7a>   DW_AT_decl_line   : (data2) 313
     <f7c>   DW_AT_decl_column : (data1) 6
     <f7d>   DW_AT_sibling     : (ref4) <0xf9a>
  <2><f81>: Abbrev Number: 72 (DW_TAG_enumerator)
-    <f82>   DW_AT_name        : (strp) (offset: 0x2745): PyUnicode_WCHAR_KIND
+    <f82>   DW_AT_name        : (strp) (offset: 0x275c): PyUnicode_WCHAR_KIND
     <f86>   DW_AT_const_value : (data1) 0
  <2><f87>: Abbrev Number: 72 (DW_TAG_enumerator)
     <f88>   DW_AT_name        : (strp) (offset: 0xabc): PyUnicode_1BYTE_KIND
     <f8c>   DW_AT_const_value : (data1) 1
  <2><f8d>: Abbrev Number: 72 (DW_TAG_enumerator)
     <f8e>   DW_AT_name        : (strp) (offset: 0x19c5): PyUnicode_2BYTE_KIND
     <f92>   DW_AT_const_value : (data1) 2
  <2><f93>: Abbrev Number: 72 (DW_TAG_enumerator)
-    <f94>   DW_AT_name        : (strp) (offset: 0x371a): PyUnicode_4BYTE_KIND
+    <f94>   DW_AT_name        : (strp) (offset: 0x3732): PyUnicode_4BYTE_KIND
     <f98>   DW_AT_const_value : (data1) 4
  <2><f99>: Abbrev Number: 0
  <1><f9a>: Abbrev Number: 22 (DW_TAG_typedef)
     <f9b>   DW_AT_name        : (strp) (offset: 0xb2b): PyLongObject
     <f9f>   DW_AT_decl_file   : (data1) 16
     <fa0>   DW_AT_decl_line   : (data1) 10
     <fa1>   DW_AT_decl_column : (data1) 28
     <fa2>   DW_AT_type        : (ref4) <0xfa6>, _longobject
  <1><fa6>: Abbrev Number: 59 (DW_TAG_structure_type)
-    <fa7>   DW_AT_name        : (strp) (offset: 0x24bb): _longobject
+    <fa7>   DW_AT_name        : (strp) (offset: 0x24d2): _longobject
     <fab>   DW_AT_byte_size   : (data1) 32
     <fac>   DW_AT_decl_file   : (data1) 17
     <fad>   DW_AT_decl_line   : (data1) 85
     <fae>   DW_AT_decl_column : (data1) 8
     <faf>   DW_AT_sibling     : (ref4) <0xfce>
  <2><fb3>: Abbrev Number: 12 (DW_TAG_member)
     <fb4>   DW_AT_name        : (strp) (offset: 0x1203): ob_base
     <fb8>   DW_AT_decl_file   : (data1) 17
     <fb9>   DW_AT_decl_line   : (data1) 86
     <fba>   DW_AT_decl_column : (data1) 5
     <fbb>   DW_AT_type        : (ref4) <0x4a8>, PyVarObject
     <fbf>   DW_AT_data_member_location: (data1) 0
  <2><fc0>: Abbrev Number: 12 (DW_TAG_member)
-    <fc1>   DW_AT_name        : (strp) (offset: 0x4e0e): ob_digit
+    <fc1>   DW_AT_name        : (strp) (offset: 0x4e19): ob_digit
     <fc5>   DW_AT_decl_file   : (data1) 17
     <fc6>   DW_AT_decl_line   : (data1) 87
     <fc7>   DW_AT_decl_column : (data1) 11
     <fc8>   DW_AT_type        : (ref4) <0xff7>, digit, uint32_t, __uint32_t, unsigned int
     <fcc>   DW_AT_data_member_location: (data1) 24
  <2><fcd>: Abbrev Number: 0
  <1><fce>: Abbrev Number: 48 (DW_TAG_variable)
-    <fcf>   DW_AT_name        : (strp) (offset: 0x4297): PyLong_Type
+    <fcf>   DW_AT_name        : (strp) (offset: 0x42af): PyLong_Type
     <fd3>   DW_AT_decl_file   : (data1) 16
     <fd4>   DW_AT_decl_line   : (data1) 12
     <fd5>   DW_AT_decl_column : (data1) 26
     <fd6>   DW_AT_type        : (ref4) <0x189>, PyTypeObject, _typeobject
     <fda>   DW_AT_external    : (flag_present) 1
     <fda>   DW_AT_declaration : (flag_present) 1
  <1><fda>: Abbrev Number: 22 (DW_TAG_typedef)
-    <fdb>   DW_AT_name        : (strp) (offset: 0x4e11): digit
+    <fdb>   DW_AT_name        : (strp) (offset: 0x4e1c): digit
     <fdf>   DW_AT_decl_file   : (data1) 17
     <fe0>   DW_AT_decl_line   : (data1) 45
     <fe1>   DW_AT_decl_column : (data1) 18
     <fe2>   DW_AT_type        : (ref4) <0x146>, uint32_t, __uint32_t, unsigned int
  <1><fe6>: Abbrev Number: 42 (DW_TAG_const_type)
     <fe7>   DW_AT_type        : (ref4) <0xfda>, digit, uint32_t, __uint32_t, unsigned int
  <1><feb>: Abbrev Number: 22 (DW_TAG_typedef)
-    <fec>   DW_AT_name        : (strp) (offset: 0x4eee): sdigit
+    <fec>   DW_AT_name        : (strp) (offset: 0x4ef9): sdigit
     <ff0>   DW_AT_decl_file   : (data1) 17
     <ff1>   DW_AT_decl_line   : (data1) 46
     <ff2>   DW_AT_decl_column : (data1) 17
     <ff3>   DW_AT_type        : (ref4) <0x104>, int32_t, __int32_t, int
  <1><ff7>: Abbrev Number: 36 (DW_TAG_array_type)
     <ff8>   DW_AT_type        : (ref4) <0xfda>, digit, uint32_t, __uint32_t, unsigned int
     <ffc>   DW_AT_sibling     : (ref4) <0x1007>
  <2><1000>: Abbrev Number: 37 (DW_TAG_subrange_type)
     <1001>   DW_AT_type        : (ref4) <0x36>, long unsigned int
     <1005>   DW_AT_upper_bound : (data1) 0
  <2><1006>: Abbrev Number: 0
  <1><1007>: Abbrev Number: 48 (DW_TAG_variable)
-    <1008>   DW_AT_name        : (strp) (offset: 0x3908): _Py_FalseStruct
+    <1008>   DW_AT_name        : (strp) (offset: 0x3920): _Py_FalseStruct
     <100c>   DW_AT_decl_file   : (data1) 18
     <100d>   DW_AT_decl_line   : (data1) 18
     <100e>   DW_AT_decl_column : (data1) 32
     <100f>   DW_AT_type        : (ref4) <0xfa6>, _longobject
     <1013>   DW_AT_external    : (flag_present) 1
     <1013>   DW_AT_declaration : (flag_present) 1
  <1><1013>: Abbrev Number: 48 (DW_TAG_variable)
@@ -2236,37 +2236,37 @@
     <108e>   DW_AT_name        : (strp) (offset: 0x10ed): ob_item
     <1092>   DW_AT_decl_file   : (data1) 22
     <1093>   DW_AT_decl_line   : (data1) 8
     <1094>   DW_AT_decl_column : (data1) 16
     <1095>   DW_AT_type        : (ref4) <0xc4e>
     <1099>   DW_AT_data_member_location: (data1) 24
  <2><109a>: Abbrev Number: 12 (DW_TAG_member)
-    <109b>   DW_AT_name        : (strp) (offset: 0x4d37): allocated
+    <109b>   DW_AT_name        : (strp) (offset: 0x4d42): allocated
     <109f>   DW_AT_decl_file   : (data1) 22
     <10a0>   DW_AT_decl_line   : (data1) 21
     <10a1>   DW_AT_decl_column : (data1) 16
     <10a2>   DW_AT_type        : (ref4) <0x15e>, Py_ssize_t, ssize_t, __ssize_t, long int
     <10a6>   DW_AT_data_member_location: (data1) 32
  <2><10a7>: Abbrev Number: 0
  <1><10a8>: Abbrev Number: 22 (DW_TAG_typedef)
-    <10a9>   DW_AT_name        : (strp) (offset: 0x4820): PyListObject
+    <10a9>   DW_AT_name        : (strp) (offset: 0x482b): PyListObject
     <10ad>   DW_AT_decl_file   : (data1) 22
     <10ae>   DW_AT_decl_line   : (data1) 22
     <10af>   DW_AT_decl_column : (data1) 3
     <10b0>   DW_AT_type        : (ref4) <0x1077>
  <1><10b4>: Abbrev Number: 48 (DW_TAG_variable)
-    <10b5>   DW_AT_name        : (strp) (offset: 0x21cd): PyDict_Type
+    <10b5>   DW_AT_name        : (strp) (offset: 0x21e4): PyDict_Type
     <10b9>   DW_AT_decl_file   : (data1) 23
     <10ba>   DW_AT_decl_line   : (data1) 15
     <10bb>   DW_AT_decl_column : (data1) 26
     <10bc>   DW_AT_type        : (ref4) <0x189>, PyTypeObject, _typeobject
     <10c0>   DW_AT_external    : (flag_present) 1
     <10c0>   DW_AT_declaration : (flag_present) 1
  <1><10c0>: Abbrev Number: 22 (DW_TAG_typedef)
-    <10c1>   DW_AT_name        : (strp) (offset: 0x258d): PyDictKeysObject
+    <10c1>   DW_AT_name        : (strp) (offset: 0x25a4): PyDictKeysObject
     <10c5>   DW_AT_decl_file   : (data1) 24
     <10c6>   DW_AT_decl_line   : (data1) 5
     <10c7>   DW_AT_decl_column : (data1) 32
     <10c8>   DW_AT_type        : (ref4) <0xdda>, _dictkeysobject
  <1><10cc>: Abbrev Number: 54 (DW_TAG_structure_type)
     <10cd>   DW_AT_byte_size   : (data1) 48
     <10ce>   DW_AT_decl_file   : (data1) 24
@@ -2298,15 +2298,15 @@
     <10fd>   DW_AT_name        : (strp) (offset: 0x105c): ma_keys
     <1101>   DW_AT_decl_file   : (data1) 24
     <1102>   DW_AT_decl_line   : (data1) 20
     <1103>   DW_AT_decl_column : (data1) 23
     <1104>   DW_AT_type        : (ref4) <0x1117>
     <1108>   DW_AT_data_member_location: (data1) 32
  <2><1109>: Abbrev Number: 12 (DW_TAG_member)
-    <110a>   DW_AT_name        : (strp) (offset: 0x3243): ma_values
+    <110a>   DW_AT_name        : (strp) (offset: 0x325b): ma_values
     <110e>   DW_AT_decl_file   : (data1) 24
     <110f>   DW_AT_decl_line   : (data1) 27
     <1110>   DW_AT_decl_column : (data1) 16
     <1111>   DW_AT_type        : (ref4) <0xc4e>
     <1115>   DW_AT_data_member_location: (data1) 40
  <2><1116>: Abbrev Number: 0
  <1><1117>: Abbrev Number: 27 (DW_TAG_pointer_type)
@@ -2315,29 +2315,29 @@
  <1><111c>: Abbrev Number: 22 (DW_TAG_typedef)
     <111d>   DW_AT_name        : (strp) (offset: 0x103a): PyDictObject
     <1121>   DW_AT_decl_file   : (data1) 24
     <1122>   DW_AT_decl_line   : (data1) 28
     <1123>   DW_AT_decl_column : (data1) 3
     <1124>   DW_AT_type        : (ref4) <0x10cc>
  <1><1128>: Abbrev Number: 48 (DW_TAG_variable)
-    <1129>   DW_AT_name        : (strp) (offset: 0x4d26): PyCFunction_Type
+    <1129>   DW_AT_name        : (strp) (offset: 0x4d31): PyCFunction_Type
     <112d>   DW_AT_decl_file   : (data1) 11
     <112e>   DW_AT_decl_line   : (data1) 14
     <112f>   DW_AT_decl_column : (data1) 26
     <1130>   DW_AT_type        : (ref4) <0x189>, PyTypeObject, _typeobject
     <1134>   DW_AT_external    : (flag_present) 1
     <1134>   DW_AT_declaration : (flag_present) 1
  <1><1134>: Abbrev Number: 22 (DW_TAG_typedef)
-    <1135>   DW_AT_name        : (strp) (offset: 0x286e): PyCFunction
+    <1135>   DW_AT_name        : (strp) (offset: 0x2885): PyCFunction
     <1139>   DW_AT_decl_file   : (data1) 11
     <113a>   DW_AT_decl_line   : (data1) 19
     <113b>   DW_AT_decl_column : (data1) 21
     <113c>   DW_AT_type        : (ref4) <0x4ea>
  <1><1140>: Abbrev Number: 22 (DW_TAG_typedef)
-    <1141>   DW_AT_name        : (strp) (offset: 0x3265): PyCFunctionWithKeywords
+    <1141>   DW_AT_name        : (strp) (offset: 0x327d): PyCFunctionWithKeywords
     <1145>   DW_AT_decl_file   : (data1) 11
     <1146>   DW_AT_decl_line   : (data1) 21
     <1147>   DW_AT_decl_column : (data1) 21
     <1148>   DW_AT_type        : (ref4) <0x50f>
  <1><114c>: Abbrev Number: 22 (DW_TAG_typedef)
     <114d>   DW_AT_name        : (strp) (offset: 0x111b): _PyCFunctionFastWithKeywords
     <1151>   DW_AT_decl_file   : (data1) 11
@@ -2357,15 +2357,15 @@
     <116c>   DW_AT_type        : (ref4) <0x95b>
  <2><1170>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <1171>   DW_AT_type        : (ref4) <0x15e>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><1175>: Abbrev Number: 10 (DW_TAG_formal_parameter)
     <1176>   DW_AT_type        : (ref4) <0x4d4>
  <2><117a>: Abbrev Number: 0
  <1><117b>: Abbrev Number: 22 (DW_TAG_typedef)
-    <117c>   DW_AT_name        : (strp) (offset: 0x26f6): PyCMethod
+    <117c>   DW_AT_name        : (strp) (offset: 0x270d): PyCMethod
     <1180>   DW_AT_decl_file   : (data1) 11
     <1181>   DW_AT_decl_line   : (data1) 26
     <1182>   DW_AT_decl_column : (data1) 21
     <1183>   DW_AT_type        : (ref4) <0x1187>
  <1><1187>: Abbrev Number: 27 (DW_TAG_pointer_type)
     <1188>   DW_AT_byte_size   : (implicit_const) 8
     <1188>   DW_AT_type        : (ref4) <0x118c>
@@ -2400,81 +2400,81 @@
     <11c5>   DW_AT_name        : (strp) (offset: 0x1203): ob_base
     <11c9>   DW_AT_decl_file   : (data1) 25
     <11ca>   DW_AT_decl_line   : (data1) 24
     <11cb>   DW_AT_decl_column : (data1) 5
     <11cc>   DW_AT_type        : (ref4) <0x473>, PyObject, _object
     <11d0>   DW_AT_data_member_location: (data1) 0
  <2><11d1>: Abbrev Number: 12 (DW_TAG_member)
-    <11d2>   DW_AT_name        : (strp) (offset: 0x44d4): m_ml
+    <11d2>   DW_AT_name        : (strp) (offset: 0x44ec): m_ml
     <11d6>   DW_AT_decl_file   : (data1) 25
     <11d7>   DW_AT_decl_line   : (data1) 25
     <11d8>   DW_AT_decl_column : (data1) 18
     <11d9>   DW_AT_type        : (ref4) <0x1213>
     <11dd>   DW_AT_data_member_location: (data1) 16
  <2><11de>: Abbrev Number: 12 (DW_TAG_member)
-    <11df>   DW_AT_name        : (strp) (offset: 0x2ee6): m_self
+    <11df>   DW_AT_name        : (strp) (offset: 0x2eec): m_self
     <11e3>   DW_AT_decl_file   : (data1) 25
     <11e4>   DW_AT_decl_line   : (data1) 26
     <11e5>   DW_AT_decl_column : (data1) 18
